validation.org
#+TITLE: Multisensor Validation Log
#+DATE: <2016-10-16>
#+AUTHOR: Vladimir Alexiev
#+EMAIL: vladimir.alexiev@ontotext.com
#+STARTUP: showeverything
#+OPTIONS: ':nil *:t -:t ::t <:t H:5 \n:nil ^:{} arch:headline author:t c:nil
#+OPTIONS: creator:comment d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+OPTIONS: p:nil pri:nil stat:t tags:t tasks:t tex:t timestamp:nil toc:t todo:t |:t
#+CREATOR: Emacs 25.0.50.1 (Org mode 8.2.10)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+TODO: TODO QUE | DONE CANCEL

[[https://rawgit.com/VladimirAlexiev/multisensor/blob/master/validation.html][HTML Rendered version]]

* Table of Contents                                            :TOC:noexport:
 - [[#intro][Intro]]
   - [[#queries][Queries]]
 - [[#validation][Validation]]
   - [[#context-extraction-service][Context Extraction Service]]
     - [[#crawler-to-decode-html-entities][Crawler to decode HTML entities]]
     - [[#keywords-vs-category][Keywords vs Category]]
     - [[#ingest-timestamp][Ingest Timestamp]]
     - [[#simmo-quality][SIMMO Quality]]
       - [[#cancel-represent-as-qualitymeasurement][CANCEL Represent as QualityMeasurement]]
       - [[#represent-as-qualityannotation][Represent as QualityAnnotation]]
       - [[#quality-queries][Quality Queries]]
     - [[#cancel-missing-authors][CANCEL Missing Authors]]
     - [[#cancel-genre-type][CANCEL Genre (Type)]]
     - [[#wrong-prefix-for-text-characteristics][Wrong prefix for Text Characteristics]]
     - [[#refresh-prefixes][Refresh Prefixes]]
   - [[#entity-linking-service][Entity Linking Service]]
     - [[#underscores-to-spaces][Underscores to Spaces]]
     - [[#cancel-remove-disambiguation-labels][CANCEL Remove Disambiguation Labels?]]
   - [[#entity-alignment-service][Entity Alignment Service]]
     - [[#also-remove-taidentconf-taidentprov][Also remove taIdentConf, taIdentProv]]
     - [[#leave-dependency-links][Leave Dependency Links]]
     - [[#use-prefixes-in-alignmentlog][Use Prefixes in alignment.log]]
   - [[#summarization-service][Summarization Service]]
     - [[#nifanchorof][nif:anchorOf]]
     - [[#cancel-why-nif-anntaidentconf-is-0][CANCEL Why nif-ann:taIdentConf is 0?]]
     - [[#cancel-msgenericconcept-vs-msspecificconcept][CANCEL ms:GenericConcept vs ms:SpecificConcept]]
     - [[#optimize-summarization-queries][Optimize Summarization Queries]]
   - [[#content-alignment][Content Alignment]]
     - [[#cap-old-model][CAP Old Model]]
     - [[#one-annotation-per-pair][One Annotation Per Pair]]
     - [[#use-msscore-not-fiseconfidence-for-cap][Use ms:score not fise:confidence for CAP]]
     - [[#add-to-ontology][Add to Ontology]]
     - [[#cap-query][CAP Query]]
     - [[#cancel-other-cap-queries][CANCEL Other CAP Queries]]
   - [[#content-translation][Content Translation]]
     - [[#babelnet-multilingual-labels][BabelNet Multilingual Labels]]
     - [[#cancel-add-spanish-babelnet-labels][CANCEL Add Spanish BabelNet Labels]]
     - [[#translated-content-queries][Translated-content Queries]]
       - [[#find-entities][Find Entities]]
       - [[#select-single-label][Select Single Label]]
       - [[#find-translations-][Find Translations ]]
 - [[#nif-instead-of-nif-ann][nif: instead of nif-ann:]]

* Intro
From now until the end of the project I'll keep a detailed log of what I validated and defects I found.
I'll use Org-mode mechanisms to track the defects (tags TODO, DONE, CANCELED) and try to monitor email conversation to keep this up to date.
The numbers in brackets after a section name show the resolved vs total defects.
Whenever a defect is posted in Jira, I'll track the issue number.

Please contact me on skype://valexiev1 for corrections/additions.
Even better, you could [[https://github.com/VladimirAlexiev/VladimirAlexiev.github.io/edit/master/Multisensor/validation.org][edit this file on github]] (it's a plain text file!) and send me a pull request.
- Mistakes or imprecise info (eg the scope of a particular service is described wrong, or a particular issue is in fact a non-issue)
- When an issue is resolved
- When an issue should be canceled
I'll also attend weekly calls related to RDF data and validation, and update this.

IMPORTANT: Just because an issue is listed in the section for a particular service, doesn't necessarily mean that service created the defect!

** Queries
Below I also track questions related to queries.
But when agreed, they should be moved to gdoc [[https://docs.google.com/document/d/1FfkiiTYvrLzHJ5P5j34NRVGPbXml0ndpNtiNbH2osRw/edit][Multisensor SPARQL Queries]].

Or we could simply use the doc:
if you need a new query, or a query needs optimization, please write a comment in red,
and notify me in a gdoc comment (add +vladimir@sirma.bg to the comment).

* Validation

** Context Extraction Service

*** TODO Crawler to decode HTML entities
It would be good if the crawler decodes HTML entities before storing in dc:subject (possibly also dc:title, dc:description). Eg:
#+BEGIN_SRC Turtle
dc:subject
  "Europ&auml;ische Union, ISIN_FR0003500008, Brexit, Erholungskurs, Europa, Paris, Gro&szlig;britannien" ,
  "Economy, Business & Finance" ;
#+END_SRC

