validation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Multisensor Validation Log</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Vladimir Alexiev" />
</head>
<body>
<div id="content">
<h1 class="title">Multisensor Validation Log</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Intro</a>
<ul>
<li><a href="#sec-1-1">Queries</a></li>
</ul>
</li>
<li><a href="#sec-2">Validation</a>
<ul>
<li><a href="#sec-2-1">Context Extraction Service</a>
<ul>
<li><a href="#sec-2-1-1"><span class="todo TODO">TODO</span> Crawler to decode HTML entities</a></li>
<li><a href="#sec-2-1-2"><span class="done DONE">DONE</span> Keywords vs Category</a></li>
<li><a href="#sec-2-1-3"><span class="done DONE">DONE</span> Ingest Timestamp</a></li>
<li><a href="#sec-2-1-4"><span class="done DONE">DONE</span> SIMMO Quality</a>
<ul>
<li><a href="#sec-2-1-4-1"><span class="done CANCEL">CANCEL</span> Represent as QualityMeasurement</a></li>
<li><a href="#sec-2-1-4-2"><span class="done DONE">DONE</span> Represent as QualityAnnotation</a></li>
<li><a href="#sec-2-1-4-3">Quality Queries</a></li>
</ul>
</li>
<li><a href="#sec-2-1-5"><span class="done CANCEL">CANCEL</span> Missing Authors</a></li>
<li><a href="#sec-2-1-6"><span class="done CANCEL">CANCEL</span> Genre (Type)</a></li>
<li><a href="#sec-2-1-7"><span class="done DONE">DONE</span> Wrong prefix for Text Characteristics</a></li>
<li><a href="#sec-2-1-8"><span class="done DONE">DONE</span> Refresh Prefixes</a></li>
</ul>
</li>
<li><a href="#sec-2-2">Entity Linking Service</a>
<ul>
<li><a href="#sec-2-2-1"><span class="todo TODO">TODO</span> Underscores to Spaces</a></li>
<li><a href="#sec-2-2-2"><span class="todo QUE">QUE</span> Remove Disambiguation Labels?</a></li>
</ul>
</li>
<li><a href="#sec-2-3">Entity Alignment Service</a>
<ul>
<li><a href="#sec-2-3-1"><span class="done DONE">DONE</span> Also remove taIdentConf, taIdentProv</a></li>
<li><a href="#sec-2-3-2"><span class="done DONE">DONE</span> Leave Dependency Links</a></li>
<li><a href="#sec-2-3-3"><span class="todo TODO">TODO</span> Use Prefixes in alignment.log</a></li>
</ul>
</li>
<li><a href="#sec-2-4">Summarization Service</a>
<ul>
<li><a href="#sec-2-4-1"><span class="done DONE">DONE</span> nif:anchorOf</a></li>
<li><a href="#sec-2-4-2"><span class="todo TODO">TODO</span> Why nif-ann:taIdentConf is 0?</a></li>
<li><a href="#sec-2-4-3"><span class="done CANCEL">CANCEL</span> ms:GenericConcept vs ms:SpecificConcept</a></li>
<li><a href="#sec-2-4-4"><span class="done DONE">DONE</span> Optimize Summarization Queries</a></li>
</ul>
</li>
<li><a href="#sec-2-5">Content Alignment</a>
<ul>
<li><a href="#sec-2-5-1">CAP Old Model</a></li>
<li><a href="#sec-2-5-2"><span class="done DONE">DONE</span> One Annotation Per Pair&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Babis">Babis</span></span></a></li>
<li><a href="#sec-2-5-3"><span class="todo TODO">TODO</span> Use ms:score not fise:confidence for CAP</a></li>
<li><a href="#sec-2-5-4"><span class="todo TODO">TODO</span> Add to Ontology&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Vladimir">Vladimir</span></span></a></li>
<li><a href="#sec-2-5-5">CAP Query</a></li>
<li><a href="#sec-2-5-6"><span class="done CANCEL">CANCEL</span> Other CAP Queries</a></li>
</ul>
</li>
<li><a href="#sec-2-6"><span class="done DONE">DONE</span> Content Translation</a>
<ul>
<li><a href="#sec-2-6-1"><span class="todo TODO">TODO</span> BabelNet Multilingual Labels</a></li>
<li><a href="#sec-2-6-2"><span class="done CANCEL">CANCEL</span> Add Spanish BabelNet Labels</a></li>
<li><a href="#sec-2-6-3">Translated-content Queries</a>
<ul>
<li><a href="#sec-2-6-3-1">Find Entities</a></li>
<li><a href="#sec-2-6-3-2">Select Single Label</a></li>
<li><a href="#sec-2-6-3-3">Find Translations</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="https://github.com/VladimirAlexiev/VladimirAlexiev.github.io/blob/master/Multisensor/validation.org">Github Source</a>, <a href="http://VladimirAlexiev.github.io/Multisensor/validation.html">HTML Rendered version</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
From now until the end of the project I'll keep a detailed log of what I validated and defects I found.
I'll use Org-mode mechanisms to track the defects (tags TODO, DONE, CANCELED) and try to monitor email conversation to keep this up to date.
The numbers in brackets after a section name show the resolved vs total defects.
Whenever a defect is posted in Jira, I'll track the issue number.
</p>

<p>
Please contact me on skype://valexiev1 for corrections/additions.
Even better, you could <a href="https://github.com/VladimirAlexiev/VladimirAlexiev.github.io/edit/master/Multisensor/validation.org">edit this file on github</a> (it's a plain text file!) and send me a pull request.
</p>
<ul class="org-ul">
<li>Mistakes or imprecise info (eg the scope of a particular service is described wrong, or a particular issue is in fact a non-issue)
</li>
<li>When an issue is resolved
</li>
<li>When an issue should be canceled
</li>
</ul>
<p>
I'll also attend weekly calls related to RDF data and validation, and update this.
</p>

<p>
IMPORTANT: Just because an issue is listed in the section for a particular service, doesn't necessarily mean that service created the defect!
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Queries</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Below I also track questions related to queries.
But when agreed, they should be moved to gdoc <a href="https://docs.google.com/document/d/1FfkiiTYvrLzHJ5P5j34NRVGPbXml0ndpNtiNbH2osRw/edit">Multisensor SPARQL Queries</a>.
</p>

<p>
Or we could simply use the doc:
if you need a new query, or a query needs optimization, please write a comment in red,
and notify me in a gdoc comment (add +vladimir@sirma.bg to the comment).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Validation</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Context Extraction Service</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="todo TODO">TODO</span> Crawler to decode HTML entities</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
It would be good if the crawler decodes HTML entities before storing in dc:subject (possibly also dc:title, dc:description). Eg:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">dc:</span>subject
  <span style="color: #8b2252;">"Europ&amp;auml;ische Union, ISIN_FR0003500008, Brexit, Erholungskurs, Europa, Paris, Gro&amp;szlig;britannien"</span> ,
  <span style="color: #8b2252;">"Economy, Business &amp; Finance"</span> ;
</pre>
</div>
</div>
</div>
