validation.org
*** DONE Keywords vs Category
Victor: both of the following fields extracted by the crawler are mapped to dc:subject:
- *category*: eg "Economy, Business & Finance" 
- *keywords*: eg "Europaische Union, ISIN_FR0003500008, Brexit, Erholungskurs, Europa, Paris, Grossbritannien"
Should we separate them in different properties?

Vladimir: 
[[https://iptc.org][IPTC]] is the [[https://iptc.org/about-iptc/][Global Standards Body]] of the News Media industry. 
[[https://iptc.org/standards/media-topics/][IPTC Media Topics]] is a list of 1100 [[http://cv.iptc.org/newscodes/mediatopic][Media Topics]] developed as an extension from earlier IPTC [[http://cv.iptc.org/newscodes/subjectcode][Subject Codes]].
You can [[http://show.newscodes.org/index.html?newscodes%3Dmedtop&lang%3Den-GB&startTo%3DShow][explore interactively]] and will see that Multisensor *categories* are similar to these topics/subjects; 
so we'll continue to map them to ~dc:subject~.

On the other hand, Multisensor *keywords* are free keywords that describe a lot more specific things.
We'll map them to ~schema:keywords~, defined as 
"Keywords or tags used to describe the content. Multiple entries in a keywords list are typically delimited by commas":
#+BEGIN_SRC Turtle
dc:subject "Economy, Business & Finance";
schema:keywords "Europaische Union, ISIN_FR0003500008, Brexit, Erholungskurs, Europa, Paris, Grossbritannien";
#+END_SRC

It would be nice to:
- Split keywords on ", " and and emit as separate values
  - (don't split categories, since the 3 words really represent one category)
- Map our categories to IPTC Media Topics. This is quite harder

*** DONE Ingest Timestamp
<2016-07-20 Wed> Almost done, only the datatype is missing.

Victor: introduce the date when the article have been processed in RDF. 
In order to keep track of which and when the “curated selected data” have been processed,
and match them with the current version of the CEP service.

Vladimir: we can use ~dct:issued~ for this purpose:
#+BEGIN_SRC Turtle
ms-content:b3f35
  dc:date    "2016-06-20T18:45:07.000+02:00"^^xsd:dateTime ; # date crawled
  dct:issued "2016-06-30T12:34:56.000+02:00"^^xsd:dateTime ; # date processed by pipeline and ingested to GDB
#+END_SRC
Boyan will add this second timestamp in the POST method.

*** DONE SIMMO Quality
Status:
- <2016-07-18> DONE: initial implementation
- <2016-07-20> DONE: make dqv:value nominal (eg ms:accuracy-low) instead of numeric (eg 1)
- <2016-07-26> DONE: use QualityAnnotation instead of QualityMeasurement

Victor: the field "c_quality" is sent now. Values can be:
- 0 = no quality assigned
- 1 = high quality
- 2 = medium quality
- 3 = low quality
- 5 = curated
Vladimir:
- Instead of a numeric scale (which is not monotonically increasing), let's use a nominal (symbolic) scale.
- Instead of 0, we should omit the statement
- There is no value 4
- About value 5: do we have metadata who & when curated it? Should we record in RDF something more than the number? 
  The selected quality ontology (DQV, see below) allows to record a lot of detail: who, when, according to what methodology...
  - Leszek (skype:letschke): we do not provide any additional meta data.

Vladimir: I searched for a [[http://lov.okfn.org/dataset/lov/terms?q%3Dquality&type%3Dproperty&page%3D2][quality property on LOV]], couldn't find anything really appropriate:
- http://www.w3.org/ns/dcat#dataQuality: this is about datasets, but is deprecated: 
  "This should not be used to describe the data collection characteristics, other more specialized statistical properties can be used instead". 
  But I don't see such statistical properties
- http://def.seegrid.csiro.au/isotc211/iso19115/2003/metadata#dataQualityInfo:
  this is about ISO 19115 "Geographic information — metadata"
  http://def.seegrid.csiro.au/isotc211/iso19115/2003/dataquality is a whole separate module on Quality
- http://purl.oclc.org/NET/ssnx/ssn#qualityOfObservation: this is about Semantic Sensor Networks.
  It makes reference to resultQuality in [[http://portal.opengeospatial.org/files/?artifact_id%3D41579][ISO 19156]] "Geographic information — Observations and measurements"

Finally from a link at Europeana DQC, I found the 
W3C [[https://www.w3.org/TR/vocab-dqv/][Data Quality Vocabulary]] ~dqv:~. 
We'll use that vocabulary, and the [[https://www.w3.org/TR/vocab-dqv/#DimensionsofZaveri][Linked Data Quality Dimensions]] ~ldqd:~ by Zaveri.

