validation.html

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="done DONE">DONE</span> Keywords vs Category</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Victor: both of the following fields extracted by the crawler are mapped to dc:subject:
</p>
<ul class="org-ul">
<li><b>category</b>: eg "Economy, Business &amp; Finance" 
</li>
<li><b>keywords</b>: eg "Europaische Union, ISIN_FR0003500008, Brexit, Erholungskurs, Europa, Paris, Grossbritannien"
</li>
</ul>
<p>
Should we separate them in different properties?
</p>

<p>
Vladimir: 
<a href="https://iptc.org">IPTC</a> is the <a href="https://iptc.org/about-iptc/">Global Standards Body</a> of the News Media industry. 
<a href="https://iptc.org/standards/media-topics/">IPTC Media Topics</a> is a list of 1100 <a href="http://cv.iptc.org/newscodes/mediatopic">Media Topics</a> developed as an extension from earlier IPTC <a href="http://cv.iptc.org/newscodes/subjectcode">Subject Codes</a>.
You can <a href="http://show.newscodes.org/index.html?newscodes=medtop&lang=en-GB&startTo=Show">explore interactively</a> and will see that Multisensor <b>categories</b> are similar to these topics/subjects; 
so we'll continue to map them to <code>dc:subject</code>.
</p>

<p>
On the other hand, Multisensor <b>keywords</b> are free keywords that describe a lot more specific things.
We'll map them to <code>schema:keywords</code>, defined as 
"Keywords or tags used to describe the content. Multiple entries in a keywords list are typically delimited by commas":
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">dc:</span><span style="color: #008b8b;">subject</span> <span style="color: #8b2252;">"Economy, Business &amp; Finance"</span><span style="color: #228b22;">;</span>
<span style="color: #228b22;">schema:</span><span style="color: #008b8b;">keywords</span> <span style="color: #8b2252;">"Europaische Union, ISIN_FR0003500008, Brexit, Erholungskurs, Europa, Paris, Grossbritannien"</span>;
</pre>
</div>

<p>
It would be nice to:
</p>
<ul class="org-ul">
<li>Split keywords on ", " and and emit as separate values
<ul class="org-ul">
<li>(don't split categories, since the 3 words really represent one category)
</li>
</ul>
</li>
<li>Map our categories to IPTC Media Topics. This is quite harder
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="done DONE">DONE</span> Ingest Timestamp</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-07-20 Wed&gt;</span></span> Almost done, only the datatype is missing.
</p>

<p>
Victor: introduce the date when the article have been processed in RDF. 
In order to keep track of which and when the “curated selected data” have been processed,
and match them with the current version of the CEP service.
</p>

<p>
Vladimir: we can use <code>dct:issued</code> for this purpose:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">ms-content:</span>b3f35
  <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">date</span>    <span style="color: #8b2252;">"2016-06-20T18:45:07.000+02:00"</span><span style="color: #008b8b;">^^xsd:dateTime</span> ; <span style="color: #b22222;"># date crawled</span>
  <span style="color: #228b22;">dct:</span><span style="color: #008b8b;">issued</span> <span style="color: #8b2252;">"2016-06-30T12:34:56.000+02:00"</span><span style="color: #008b8b;">^^xsd:dateTime</span> ; <span style="color: #b22222;"># date processed by pipeline and ingested to GDB</span>
</pre>
</div>
<p>
Boyan will add this second timestamp in the POST method.
</p>
</div>
</div>

<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="done DONE">DONE</span> SIMMO Quality</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
Status:
</p>
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2016-07-18&gt;</span></span> DONE: initial implementation
</li>
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2016-07-20&gt;</span></span> DONE: make dqv:value nominal (eg ms:accuracy-low) instead of numeric (eg 1)
</li>
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2016-07-26&gt;</span></span> DONE: use QualityAnnotation instead of QualityMeasurement
</li>
</ul>

<p>
Victor: the field "c_quality" is sent now. Values can be:
</p>
<ul class="org-ul">
<li>0 = no quality assigned
</li>
<li>1 = high quality
</li>
<li>2 = medium quality
</li>
<li>3 = low quality
</li>
<li>5 = curated
</li>
</ul>
<p>
Vladimir:
</p>
<ul class="org-ul">
<li>Instead of a numeric scale (which is not monotonically increasing), let's use a nominal (symbolic) scale.
</li>
<li>Instead of 0, we should omit the statement
</li>
<li>There is no value 4
</li>
<li>About value 5: do we have metadata who &amp; when curated it? Should we record in RDF something more than the number? 
The selected quality ontology (DQV, see below) allows to record a lot of detail: who, when, according to what methodology&#x2026;
<ul class="org-ul">
<li>Leszek (skype:letschke): we do not provide any additional meta data.
</li>
</ul>
</li>
</ul>

<p>
Vladimir: I searched for a <a href="http://lov.okfn.org/dataset/lov/terms?q=quality&type=property&page=2">quality property on LOV</a>, couldn't find anything really appropriate:
</p>
<ul class="org-ul">
<li><a href="http://www.w3.org/ns/dcat#dataQuality">http://www.w3.org/ns/dcat#dataQuality</a>: this is about datasets, but is deprecated: 
"This should not be used to describe the data collection characteristics, other more specialized statistical properties can be used instead". 
But I don't see such statistical properties
</li>
<li><a href="http://def.seegrid.csiro.au/isotc211/iso19115/2003/metadata#dataQualityInfo">http://def.seegrid.csiro.au/isotc211/iso19115/2003/metadata#dataQualityInfo</a>:
this is about ISO 19115 "Geographic information — metadata"
<a href="http://def.seegrid.csiro.au/isotc211/iso19115/2003/dataquality">http://def.seegrid.csiro.au/isotc211/iso19115/2003/dataquality</a> is a whole separate module on Quality
</li>
<li><a href="http://purl.oclc.org/NET/ssnx/ssn#qualityOfObservation">http://purl.oclc.org/NET/ssnx/ssn#qualityOfObservation</a>: this is about Semantic Sensor Networks.
It makes reference to resultQuality in <a href="http://portal.opengeospatial.org/files/?artifact_id=41579">ISO 19156</a> "Geographic information — Observations and measurements"
</li>
</ul>

<p>
Finally from a link at Europeana DQC, I found the 
W3C <a href="https://www.w3.org/TR/vocab-dqv/">Data Quality Vocabulary</a> <code>dqv:</code>. 
We'll use that vocabulary, and the <a href="https://www.w3.org/TR/vocab-dqv/#DimensionsofZaveri">Linked Data Quality Dimensions</a> <code>ldqd:</code> by Zaveri.
</p>
</div>
