validation.org
**** CANCEL Represent as QualityMeasurement
Initially I tried this representation. 
But after discussion at [[mailto:public-dwbp-comments@w3.org]], it was clarified that QualityMeasurement can only be used with literal values, so this is WRONG.
See next section for the correct representation.

First we add a ~dqv:Metric~ to the Multisensor ontology:
#+BEGIN_SRC Turtle
@prefix dqv:  <http://www.w3.org/ns/dqv#> .
@prefix ldqd: <http://www.w3.org/2016/05/ldqd#> .

ms:accuracy a dqv:Metric;
  skos:prefLabel "Accuracy"@en;
  skos:definition "Degree to which SIMMO data correctly represents real world facts."@en;
  dqv:inDimension ldqd:semanticAccuracy;
  dqv:expectedDataType ms:Accuracy.

ms:Accuracy a owl:Class, skos:ConceptScheme;
  rdfs:label "Accuracy values"@en.
ms:accuracy-low a ms:Accuracy, skos:Concept; skos:inScheme ms:Accuracy;
  skos:prefLabel "Low accuracy"@en.
ms:accuracy-medium a ms:Accuracy, skos:Concept; skos:inScheme ms:Accuracy;
  skos:prefLabel "Medium accuracy"@en.
ms:accuracy-high a ms:Accuracy, skos:Concept; skos:inScheme ms:Accuracy;
  skos:prefLabel "High accuracy"@en.
ms:accuracy-curated a ms:Accuracy, skos:Concept; skos:inScheme ms:Accuracy;
  skos:prefLabel "Manually curated"@en;
  skos:note "Highest accuracy"@en.
#+END_SRC

Then for each SIMMO that has a quality rating (SIMMOS that don't have a rating get no extra statements):
#+BEGIN_SRC Turtle
ms-content:b3f35 dqv:hasQualityMeasurement ms-content:b3f35-quality.

ms-content:b3f35-quality a dqv:QualityMeasurement ;
   dqv:isMeasurementOf ms:accuracy; dqv:value ms:accuracy-curated.
#+END_SRC

**** DONE Represent as QualityAnnotation
The correct way to use nominal values is to use QualityAnnotation instead of QualityMeasurement.

First we define the nominal values in the ontology:
#+BEGIN_SRC Turtle
@prefix dqv:  <http://www.w3.org/ns/dqv#> .
@prefix ldqd: <http://www.w3.org/2016/05/ldqd#> .

ms:Accuracy a skos:ConceptScheme;
  rdfs:label "Accuracy values"@en.
ms:accuracy-low a skos:Concept; skos:inScheme ms:Accuracy;
  skos:prefLabel "Low accuracy"@en.
ms:accuracy-medium a skos:Concept; skos:inScheme ms:Accuracy;
  skos:prefLabel "Medium accuracy"@en.
ms:accuracy-high a skos:Concept; skos:inScheme ms:Accuracy;
  skos:prefLabel "High accuracy"@en.
ms:accuracy-curated a skos:Concept; skos:inScheme ms:Accuracy;
  skos:prefLabel "Manually curated"@en;
  skos:note "Highest accuracy"@en.
#+END_SRC

Then for every SIMMO with a quality rating:
#+BEGIN_SRC Turtle
ms-content:b3f35 dqv:hasQualityAnnotation ms-content:b3f35-quality.
ms-content:b3f35-quality a dqv:QualityAnnotation;
  dqv:inDimension ldqd:semanticAccuracy;
  oa:motivatedBy dqv:qualityAssessment;
  oa:hasTarget ms-content:b3f35;
  oa:hasBody ms:accuracy-curated.
#+END_SRC

