validation.html

<div id="outline-container-sec-2-1-4-1" class="outline-5">
<h5 id="sec-2-1-4-1"><span class="done CANCEL">CANCEL</span> Represent as QualityMeasurement</h5>
<div class="outline-text-5" id="text-2-1-4-1">
<p>
Initially I tried this representation. 
But after discussion at <a href="mailto:public-dwbp-comments@w3.org">mailto:public-dwbp-comments@w3.org</a>, it was clarified that QualityMeasurement can only be used with literal values, so this is WRONG.
See next section for the correct representation.
</p>

<p>
First we add a <code>dqv:Metric</code> to the Multisensor ontology:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #a020f0;">@prefix</span> <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;"> </span> <span style="color: #0000ff;">&lt;http://www.w3.org/ns/dqv#&gt;</span><span style="color: #b22222;"> .</span>
<span style="color: #a020f0;">@prefix</span> <span style="color: #228b22;">ldqd:</span><span style="color: #008b8b;"> </span><span style="color: #0000ff;">&lt;http://www.w3.org/2016/05/ldqd#&gt;</span><span style="color: #b22222;"> </span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;">Metric</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"Accuracy"</span>@en;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">definition</span> <span style="color: #8b2252;">"Degree to which SIMMO data correctly represents real world facts."</span>@en;
  <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;">inDimension</span> <span style="color: #228b22;">ldqd:</span><span style="color: #008b8b;">semanticAccuracy</span>;
  <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;">expectedDataType</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy</span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">owl:</span><span style="color: #008b8b;">Class,</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">ConceptScheme</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Accuracy values"</span><span style="color: #228b22;">@en.</span>
<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy-low</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy,</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"Low accuracy"</span><span style="color: #228b22;">@en.</span>
<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy-medium</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy,</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"Medium accuracy"</span><span style="color: #228b22;">@en.</span>
<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy-high</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy,</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"High accuracy"</span><span style="color: #228b22;">@en.</span>
<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy-curated</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy,</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"Manually curated"</span>@en;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">note</span> <span style="color: #8b2252;">"Highest accuracy"</span>@en.
</pre>
</div>

<p>
Then for each SIMMO that has a quality rating (SIMMOS that don't have a rating get no extra statements):
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">b3f35</span> <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;">hasQualityMeasurement</span> <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">b3f35-quality</span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">b3f35-quality</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;">QualityMeasurement</span> ;
   <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;">isMeasurementOf</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy</span>; <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;">value</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy-curated</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-4-2" class="outline-5">
<h5 id="sec-2-1-4-2"><span class="done DONE">DONE</span> Represent as QualityAnnotation</h5>
<div class="outline-text-5" id="text-2-1-4-2">
<p>
The correct way to use nominal values is to use QualityAnnotation instead of QualityMeasurement.
</p>

<p>
First we define the nominal values in the ontology:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #a020f0;">@prefix</span> <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;"> </span> <span style="color: #0000ff;">&lt;http://www.w3.org/ns/dqv#&gt;</span><span style="color: #b22222;"> .</span>
<span style="color: #a020f0;">@prefix</span> <span style="color: #228b22;">ldqd:</span><span style="color: #008b8b;"> </span><span style="color: #0000ff;">&lt;http://www.w3.org/2016/05/ldqd#&gt;</span><span style="color: #b22222;"> </span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">ConceptScheme</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Accuracy values"</span><span style="color: #228b22;">@en.</span>
<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy-low</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"Low accuracy"</span><span style="color: #228b22;">@en.</span>
<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy-medium</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"Medium accuracy"</span><span style="color: #228b22;">@en.</span>
<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy-high</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"High accuracy"</span><span style="color: #228b22;">@en.</span>
<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy-curated</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">Accuracy</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"Manually curated"</span>@en;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">note</span> <span style="color: #8b2252;">"Highest accuracy"</span>@en.
</pre>
</div>

<p>
Then for every SIMMO with a quality rating:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">b3f35</span> <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;">hasQualityAnnotation</span> <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">b3f35-quality</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">b3f35-quality</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;">QualityAnnotation</span>;
  <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;">inDimension</span> <span style="color: #228b22;">ldqd:</span><span style="color: #008b8b;">semanticAccuracy</span>;
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">motivatedBy</span> <span style="color: #228b22;">dqv:</span><span style="color: #008b8b;">qualityAssessment</span>;
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">hasTarget</span> <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">b3f35</span>;
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">hasBody</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">accuracy-curated</span>.
</pre>
</div>
</div>
</div>
