validation.org
**** Quality Queries
Querying for SIMMOs with quality is easy:
#+BEGIN_SRC sparql
select * {
  ?simmo a foaf:Document; dqv:hasQualityAnnotation/oa:hasBody ?quality}
#+END_SRC

An update query to migrate old QualityMeasurement data to the new QualityAnnotation representation:
#+BEGIN_SRC sparql
delete {
  graph ?graph {
    ?simmo dqv:hasQualityMeasurement ?quality.
    ?quality ?p ?v}}
insert {
  graph ?graph {
    ?simmo dqv:hasQualityAnnotation ?quality.
    ?quality a dqv:QualityAnnotation;
      dqv:inDimension ldqd:semanticAccuracy;
      oa:motivatedBy dqv:qualityAssessment;
      oa:hasTarget ?simmo;
      oa:hasBody ?value}}
where {
  graph ?graph {
    ?simmo dqv:hasQualityMeasurement ?quality.
    ?quality dqv:value ?value}}
#+END_SRC

*** CANCEL Missing Authors
#+BEGIN_SRC sparql
select * {?x a foaf:Document} 
# 112k SIMMOs
select * {?x a foaf:Document; dc:creator ?y}
# 10.5k authors, only 9.4%
#+END_SRC
- Can we get more authors?
Discussion <2016-07-08 Fri> [[https://quark.everis.com/jira/browse/MULTISENSO-186][MULTISENSO-186]]:
- Andrey:  Interest in the "genre", “author” feature if available (not always retrievable by the context extraction service)
- Ioannis: The genre and author information can only be extracted when they are available in the HTML content of the scrapped page, otherwise we cannot infer it. To this end, there is not much we can do.
  It was quite obvious on the planning stage that not all articles have mentioned fields in HTML tags, and it could be foreseen, maybe with additional parsing methods since not always html tags do have this information, but normally all news articles have for example Author info in the body of the article. So this part can be closed, as "it" will not going to happen.

*** CANCEL Genre (Type)
Vladimir & Ioannis: by *Genre*, do you mean dc:type? We assume so below.

#+BEGIN_SRC sparql
select * {?x a foaf:Document; dc:type ?y} 
# 20k, that's 17.9%
#+END_SRC
- Q: Can we get more genres?
- A: Same comments as in the previous section apply.

Distribution of Genre:
#+BEGIN_SRC sparql
select ?y (count(*) as ?c)
{?x a foaf:Document; dc:type ?y}
group by ?y order by desc(?c)
#+END_SRC
| Genre/Type        | Count | Notes                  |
|-------------------+-------+------------------------|
| article           | 14768 |                        |
| music             |  2886 |                        |
| website           |  1087 |                        |
| speech            |   813 |                        |
| sound             |   407 |                        |
| food              |    83 | ?? Maybe "recipe"      |
| video             |    25 |                        |
| Article           |    25 | normalize to "article" |
| single            |    11 |                        |
| song              |    11 |                        |
| Speech            |    11 |                        |
| Ogg               |    11 | normalize to "sound"   |
| video.other       |     7 | normalize to "video"   |
| news              |     6 |                        |
| ARTICLE           |     4 | normalize to "article" |
| media             |     2 |                        |
| blog              |     1 |                        |
| slideshow         |     1 |                        |
| video.movie       |     1 | normalize to "video"   |
| tumblr-feed:entry |     1 |                        |
<2016-07-08 Fri>
- Vladimir: it would be nice to normalize some values, and reduce this from 20 to say 10 rows
- Ioannis: the code to extract "type" was written over a year ago, so this would not be so simple
- Vladimir and Ioannis: the first 5 types catch 90%, so it's only the "long tail" would need normalization... This is not so important

*** DONE Wrong prefix for Text Characteristics
Advanced Context Extraction adds new Text Characteristics properties (~ms:technicality, ms:fluency, ms:richness~) 
to the context (property definitions omitted for brevity).

Example (this particular text is fluent, but is neither rich nor technical, so we set values 5, 1, 1 respectively):
#+BEGIN_SRC Turtle
@base <http://data.multisensorproject.eu/content/9e9c304>.

<#char=0,2000> a nif:Context;
  nif:isString "This is the whole text of the SIMMO.\n It should continue for 2000 chars but I'll stop here"@en;
  ms:fluency      5.0;
  ms:richness     1.0;
  ms:technicality 1.0.
#+END_SRC

<2016-06-23 Thu>: checked [[http://grinder1.multisensorproject.eu/cepfiles/rdf_validation/context_extraction_validation/0e6b24-CONTEXT_EXTRACTION-22-6-2016.ttl][0e6b24-CONTEXT_EXTRACTION-22-6-2016.ttl]] and Text Characteristics (technicality, fluency, richness):
- currently use <http://data.multisensor.eu/ontology#>
- but the correct prefix is <http://data.multisensorproject.eu/ontology#>
Victor <2016-06-30 Thu>: updated the prefix

