validation.html

<div id="outline-container-sec-2-1-4-3" class="outline-5">
<h5 id="sec-2-1-4-3">Quality Queries</h5>
<div class="outline-text-5" id="text-2-1-4-3">
<p>
Querying for SIMMOs with quality is easy:
</p>
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">select</span> * {
  <span style="color: #a0522d;">?simmo</span> a foaf:Document; dqv:hasQualityAnnotation/oa:hasBody <span style="color: #a0522d;">?quality</span>}
</pre>
</div>

<p>
An update query to migrate old QualityMeasurement data to the new QualityAnnotation representation:
</p>
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">delete</span> {
  <span style="color: #a020f0;">graph</span> <span style="color: #a0522d;">?graph</span> {
    <span style="color: #a0522d;">?simmo</span> dqv:hasQualityMeasurement <span style="color: #a0522d;">?quality</span>.
    <span style="color: #a0522d;">?quality</span> <span style="color: #a0522d;">?p</span> <span style="color: #a0522d;">?v</span>}}
<span style="color: #a020f0;">insert</span> {
  <span style="color: #a020f0;">graph</span> <span style="color: #a0522d;">?graph</span> {
    <span style="color: #a0522d;">?simmo</span> dqv:hasQualityAnnotation <span style="color: #a0522d;">?quality</span>.
    <span style="color: #a0522d;">?quality</span> a dqv:QualityAnnotation;
      dqv:inDimension ldqd:semanticAccuracy;
      oa:motivatedBy dqv:qualityAssessment;
      oa:hasTarget <span style="color: #a0522d;">?simmo</span>;
      oa:hasBody <span style="color: #a0522d;">?value</span>}}
<span style="color: #a020f0;">where</span> {
  <span style="color: #a020f0;">graph</span> <span style="color: #a0522d;">?graph</span> {
    <span style="color: #a0522d;">?simmo</span> dqv:hasQualityMeasurement <span style="color: #a0522d;">?quality</span>.
    <span style="color: #a0522d;">?quality</span> dqv:value <span style="color: #a0522d;">?value</span>}}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="done CANCEL">CANCEL</span> Missing Authors</h4>
<div class="outline-text-4" id="text-2-1-5">
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">select</span> * {<span style="color: #a0522d;">?x</span> a foaf:Document} 
<span style="color: #b22222;"># 112k SIMMOs</span>
<span style="color: #a020f0;">select</span> * {<span style="color: #a0522d;">?x</span> a foaf:Document; dc:creator <span style="color: #a0522d;">?y</span>}
<span style="color: #b22222;"># 10.5k authors, only 9.4%</span>
</pre>
</div>
<ul class="org-ul">
<li>Can we get more authors?
</li>
</ul>
<p>
Discussion <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-07-08 Fri&gt;</span></span> <a href="https://quark.everis.com/jira/browse/MULTISENSO-186">MULTISENSO-186</a>:
</p>
<ul class="org-ul">
<li>Andrey:  Interest in the "genre", “author” feature if available (not always retrievable by the context extraction service)
</li>
<li>Ioannis: The genre and author information can only be extracted when they are available in the HTML content of the scrapped page, otherwise we cannot infer it. To this end, there is not much we can do.
It was quite obvious on the planning stage that not all articles have mentioned fields in HTML tags, and it could be foreseen, maybe with additional parsing methods since not always html tags do have this information, but normally all news articles have for example Author info in the body of the article. So this part can be closed, as "it" will not going to happen.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-6" class="outline-4">
<h4 id="sec-2-1-6"><span class="done CANCEL">CANCEL</span> Genre (Type)</h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
Vladimir &amp; Ioannis: by <b>Genre</b>, do you mean dc:type? We assume so below.
</p>

<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">select</span> * {<span style="color: #a0522d;">?x</span> a foaf:Document; dc:type <span style="color: #a0522d;">?y</span>} 
<span style="color: #b22222;"># 20k, that's 17.9%</span>
</pre>
</div>
<ul class="org-ul">
<li>Q: Can we get more genres?
</li>
<li>A: Same comments as in the previous section apply.
</li>
</ul>

<p>
Distribution of Genre:
</p>
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">select</span> <span style="color: #a0522d;">?y</span> (count(*) <span style="color: #a020f0;">as</span> <span style="color: #a0522d;">?c</span>)
{<span style="color: #a0522d;">?x</span> a foaf:Document; dc:type <span style="color: #a0522d;">?y</span>}
<span style="color: #a020f0;">group</span> <span style="color: #a020f0;">by</span> <span style="color: #a0522d;">?y</span> <span style="color: #a020f0;">order</span> <span style="color: #a020f0;">by</span> <span style="color: #a020f0;">desc</span>(<span style="color: #a0522d;">?c</span>)
</pre>
</div>
<table border="1" cellspacing="0" cellpadding="2" rules="all" frame="box">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Genre/Type</th>
<th scope="col" class="right">Count</th>
<th scope="col" class="left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">article</td>
<td class="right">14768</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">music</td>
<td class="right">2886</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">website</td>
<td class="right">1087</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">speech</td>
<td class="right">813</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">sound</td>
<td class="right">407</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">food</td>
<td class="right">83</td>
<td class="left">?? Maybe "recipe"</td>
</tr>

<tr>
<td class="left">video</td>
<td class="right">25</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Article</td>
<td class="right">25</td>
<td class="left">normalize to "article"</td>
</tr>

<tr>
<td class="left">single</td>
<td class="right">11</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">song</td>
<td class="right">11</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Speech</td>
<td class="right">11</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Ogg</td>
<td class="right">11</td>
<td class="left">normalize to "sound"</td>
</tr>

<tr>
<td class="left">video.other</td>
<td class="right">7</td>
<td class="left">normalize to "video"</td>
</tr>

<tr>
<td class="left">news</td>
<td class="right">6</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ARTICLE</td>
<td class="right">4</td>
<td class="left">normalize to "article"</td>
</tr>

<tr>
<td class="left">media</td>
<td class="right">2</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">blog</td>
<td class="right">1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">slideshow</td>
<td class="right">1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">video.movie</td>
<td class="right">1</td>
<td class="left">normalize to "video"</td>
</tr>

<tr>
<td class="left">tumblr-feed:entry</td>
<td class="right">1</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-07-08 Fri&gt;</span></span>
</p>
<ul class="org-ul">
<li>Vladimir: it would be nice to normalize some values, and reduce this from 20 to say 10 rows
</li>
<li>Ioannis: the code to extract "type" was written over a year ago, so this would not be so simple
</li>
<li>Vladimir and Ioannis: the first 5 types catch 90%, so it's only the "long tail" would need normalization&#x2026; This is not so important
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-7" class="outline-4">
<h4 id="sec-2-1-7"><span class="done DONE">DONE</span> Wrong prefix for Text Characteristics</h4>
<div class="outline-text-4" id="text-2-1-7">
<p>
Advanced Context Extraction adds new Text Characteristics properties (<code>ms:technicality, ms:fluency, ms:richness</code>) 
to the context (property definitions omitted for brevity).
</p>

<p>
Example (this particular text is fluent, but is neither rich nor technical, so we set values 5, 1, 1 respectively):
</p>
<div class="org-src-container">

<pre class="src src-Turtle">@base <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/9e9c304&gt;</span>.

<span style="color: #0000ff;">&lt;#char=0,2000&gt;</span><span style="color: #b22222;"> </span><span style="color: #a020f0;">a</span><span style="color: #b22222;"> </span><span style="color: #228b22;">nif:</span><span style="color: #008b8b;">Context</span><span style="color: #b22222;">;</span>
  <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">isString</span> <span style="color: #8b2252;">"This is the whole text of the SIMMO.\n It should continue for 2000 chars but I'll stop here"</span>@en;
  <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">fluency</span>      5.0;
  <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">richness</span>     1.0;
  <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">technicality</span> 1.0.
</pre>
</div>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-06-23 Thu&gt;</span></span>: checked <a href="http://grinder1.multisensorproject.eu/cepfiles/rdf_validation/context_extraction_validation/0e6b24-CONTEXT_EXTRACTION-22-6-2016.ttl">0e6b24-CONTEXT_EXTRACTION-22-6-2016.ttl</a> and Text Characteristics (technicality, fluency, richness):
</p>
<ul class="org-ul">
<li>currently use <a href="http://data.multisensor.eu/ontology#">http://data.multisensor.eu/ontology#</a>
</li>
<li>but the correct prefix is <a href="http://data.multisensorproject.eu/ontology#">http://data.multisensorproject.eu/ontology#</a>
</li>
</ul>
<p>
Victor <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-06-30 Thu&gt;</span></span>: updated the prefix
</p>
</div>
</div>
