validation.org
*** DONE Refresh Prefixes
I've added http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-annotation# to [[./img/prefixes.ttl]] (committed <2016-06-30 Thu>)
Please refresh from [[./img/prefixes.ttl]], so new validation files use this prefix.

Gerard: what exactly are we suppposed to do with the prefixes file.
- Once loaded in the repo (Boyan's job), we can make queries without mentioning the prefixes.
Should we load it into Sesame somehow so that triples are generated with prefixes? 
If so, could you give us some code showing how to do it?
- I think the validation files use prefixes, because prefixes.ttl is prepended, then passed through RIOT.
  I think Victor made that script. The other prefixes are there, so it's just a matter of refreshing

** Entity Linking Service

*** TODO Underscores to Spaces
The EL service emits Babelnet entity labels in up to 4 languages, eg
#+BEGIN_SRC Turtle
bn:s00088614v  skos:prefLabel  "zu_befriedigen"@de , "satisfacer"@es , "satisfaire"@fr , "задоволи"@bg .
bn:s00014609n  skos:prefLabel  "Kuchen"@de , "Pastel_(gastronomía)"@es , "Gâteau"@fr , "Торта"@bg .
bn:s01718102n  skos:prefLabel  "I_do_not_want_what_I_haven't_got"@es , "I_Don't_Want_What_I_Haven't_Got"@en , "I_Do_Not_Want_What_I_Haven't_Got"@fr .
bn:s02229586n  skos:prefLabel  "UHC_Hamburg"@en , "Uhlenhorster_HC"@fr .
#+END_SRC
For reasons unknown, Babelnet uses underscores (eg see [[http://babelnet.org/rdf/page/UHC_Hamburg_n_EN][UHC_Hamburg_n_EN]]).
I think we should convert the underscores to spaces to make the label more natural.

- Can be fixed in the repo with a query like this
  - However this doesn't find Babelnet *broader* entities imported by ONTO. We have a list of all Babelnet entities, maybe better to use this somehow
#+BEGIN_SRC sparql
delete {?x skos:prefLabel ?lab}
insert {?x skos:prefLabel ?lab1}
where {
    ?x skos:prefLabel ?lab
    filter exists {[its:taIdentRef ?x; nif-ann:taIdentProv <http://babelfy.org/>]}
    filter(regex(?lab,"_"))
    bind(replace(?lab,"_"," ") as ?lab1)
}
#+END_SRC
- UPF code that brings in new Babelnet enrichments should be fixed too.
  Gerard: DONE <2016-07-20 Wed>
	Entitly Linking: Translations obtained from BabelNet are now issued as literals of skos:prefLabel triples without underscores.
- UPF code that creates ~nif:lemma~ should be fixed, eg this node has lemma "basic_data"
  http://multisensor.ontotext.com/resource/ms-content/00a17bdb91543c45349f42378caeecd434c1a8f4%23char=281,291
  Gerard: DONE <2016-07-20 Wed>.
	Dependency parsing: lemmas are also emitted as literals of nif:lemma triples without underscores
- IMPORTANT <2016-08-12 Fri> Now we have two labels per BN concept per language. Must remove the superfluous ones. Eg:
  - bn:s03113558n: "Royal Ordnance Factories F.C."@en and "Royal_Ordnance_Factories_F.C."@en
  - bn:s00124949n: "Prefijo del Segmento de Programa"@es and "Prefijo_del_Segmento_de_Programa"@es
- Gerard <2016-09-06 Tue>: The EL service only issues labels without underscores, so the ones with underscores are the ouput of running older versions of the service.

*** CANCEL Remove Disambiguation Labels?
Should we also remove disambiguations, which are trailing parenthesized parts, eg "Pastel_(gastronomía)" -> "Pastel"?
Since these labels are not used for NLP tasks, and the disambiguations are very useful for understanding what the entity is, I vote to leave them.
- Gerard: I also vote to leave them, more so considering that they can easily be postprocessed by the UI if ever needed.

