validation.html

<div id="outline-container-sec-2-1-8" class="outline-4">
<h4 id="sec-2-1-8"><span class="done DONE">DONE</span> Refresh Prefixes</h4>
<div class="outline-text-4" id="text-2-1-8">
<p>
I've added <a href="http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-annotation">http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-annotation</a># to <a href="./img/prefixes.ttl">./img/prefixes.ttl</a> (committed <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-06-30 Thu&gt;</span></span>)
Please refresh from <a href="./img/prefixes.ttl">./img/prefixes.ttl</a>, so new validation files use this prefix.
</p>

<p>
Gerard: what exactly are we suppposed to do with the prefixes file.
</p>
<ul class="org-ul">
<li>Once loaded in the repo (Boyan's job), we can make queries without mentioning the prefixes.
</li>
</ul>
<p>
Should we load it into Sesame somehow so that triples are generated with prefixes? 
If so, could you give us some code showing how to do it?
</p>
<ul class="org-ul">
<li>I think the validation files use prefixes, because prefixes.ttl is prepended, then passed through RIOT.
I think Victor made that script. The other prefixes are there, so it's just a matter of refreshing
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Entity Linking Service</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="todo TODO">TODO</span> Underscores to Spaces</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
The EL service emits Babelnet entity labels in up to 4 languages, eg
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #228b22;">bn:</span><span style="color: #008b8b;">s00088614v</span>  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span>  <span style="color: #8b2252;">"zu_befriedigen"</span>@de , <span style="color: #8b2252;">"satisfacer"</span>@es , <span style="color: #8b2252;">"satisfaire"</span>@fr , <span style="color: #8b2252;">"&#1079;&#1072;&#1076;&#1086;&#1074;&#1086;&#1083;&#1080;"</span>@bg <span style="color: #228b22;">.</span>
<span style="color: #228b22;">bn:</span><span style="color: #008b8b;">s00014609n</span>  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span>  <span style="color: #8b2252;">"Kuchen"</span>@de , <span style="color: #8b2252;">"Pastel_(gastronom&#237;a)"</span>@es , <span style="color: #8b2252;">"G&#226;teau"</span>@fr , <span style="color: #8b2252;">"&#1058;&#1086;&#1088;&#1090;&#1072;"</span>@bg <span style="color: #228b22;">.</span>
<span style="color: #228b22;">bn:</span><span style="color: #008b8b;">s01718102n</span>  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span>  <span style="color: #8b2252;">"I_do_not_want_what_I_haven't_got"</span>@es , <span style="color: #8b2252;">"I_Don't_Want_What_I_Haven't_Got"</span>@en , <span style="color: #8b2252;">"I_Do_Not_Want_What_I_Haven't_Got"</span>@fr <span style="color: #228b22;">.</span>
<span style="color: #228b22;">bn:</span><span style="color: #008b8b;">s02229586n</span>  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span>  <span style="color: #8b2252;">"UHC_Hamburg"</span>@en , <span style="color: #8b2252;">"Uhlenhorster_HC"</span>@fr .
</pre>
</div>
<p>
For reasons unknown, Babelnet uses underscores (eg see <a href="http://babelnet.org/rdf/page/UHC_Hamburg_n_EN">UHC_Hamburg_n_EN</a>).
I think we should convert the underscores to spaces to make the label more natural.
</p>

<ul class="org-ul">
<li>Can be fixed in the repo with a query like this
<ul class="org-ul">
<li>However this doesn't find Babelnet <b>broader</b> entities imported by ONTO. We have a list of all Babelnet entities, maybe better to use this somehow
</li>
</ul>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">delete</span> {<span style="color: #a0522d;">?x</span> skos:prefLabel <span style="color: #a0522d;">?lab</span>}
<span style="color: #a020f0;">insert</span> {<span style="color: #a0522d;">?x</span> skos:prefLabel <span style="color: #a0522d;">?lab1</span>}
<span style="color: #a020f0;">where</span> {
    <span style="color: #a0522d;">?x</span> skos:prefLabel <span style="color: #a0522d;">?lab</span>
    <span style="color: #a020f0;">filter</span> <span style="color: #a020f0;">exists</span> {[its:taIdentRef <span style="color: #a0522d;">?x</span>; nif-ann:taIdentProv <span style="color: #008b8b;">&lt;http://babelfy.org/&gt;</span>]}
    <span style="color: #a020f0;">filter</span>(regex(<span style="color: #a0522d;">?lab</span>,<span style="color: #8b2252;">"_"</span>))
    <span style="color: #a020f0;">bind</span>(replace(<span style="color: #a0522d;">?lab</span>,<span style="color: #8b2252;">"_"</span>," ") <span style="color: #a020f0;">as</span> <span style="color: #a0522d;">?lab1</span>)
}
</pre>
</div>
<ul class="org-ul">
<li>UPF code that brings in new Babelnet enrichments should be fixed too.
Gerard: DONE <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-07-20 Wed&gt;</span></span>
      Entitly Linking: Translations obtained from BabelNet are now issued as literals of skos:prefLabel triples without underscores.
</li>
<li>UPF code that creates <code>nif:lemma</code> should be fixed, eg this node has lemma "basic_data"
<a href="http://multisensor.ontotext.com/resource/ms-content/00a17bdb91543c45349f42378caeecd434c1a8f4#char=281,291">http://multisensor.ontotext.com/resource/ms-content/00a17bdb91543c45349f42378caeecd434c1a8f4#char=281,291</a>
Gerard: DONE <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-07-20 Wed&gt;</span></span>.
      Dependency parsing: lemmas are also emitted as literals of nif:lemma triples without underscores
</li>
<li>IMPORTANT <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-08-12 Fri&gt;</span></span> Now we have two labels per BN concept per language. Must remove the superfluous ones. Eg:
<ul class="org-ul">
<li>bn:s03113558n: "Royal Ordnance Factories F.C."@en and "Royal_Ordnance_Factories_F.C."@en
</li>
<li>bn:s00124949n: "Prefijo del Segmento de Programa"@es and "Prefijo_del_Segmento_de_Programa"@es
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="todo QUE">QUE</span> Remove Disambiguation Labels?</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Should we also remove disambiguations, which are trailing parenthesized parts, eg "Pastel_(gastronomía)" -&gt; "Pastel"?
Since these labels are not used for NLP tasks, and the disambiguations are very useful for understanding what the entity is, I vote to leave them.
</p>
</div>
</div>
</div>
