validation.html

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Entity Alignment Service</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-06-28 Tue&gt;</span></span>: checked <a href="http://grinder1.multisensorproject.eu/cepfiles/rdf_validation/entity_alignment/0181e1-ENTITY_ALIGNMENT-21-6-2016.ttl">0181e1-ENTITY_ALIGNMENT-21-6-2016.ttl</a> and alignment.log (by email)
</p>

<p>
The log has 90 actions. I checked these 4 actions:
</p>
<pre class="example">
2016-06-21 16:22:18 INFO  Alignment:42 - Comparing &lt;#char=1453,1461&gt; and &lt;#char=1444,1461&gt;
2016-06-21 16:22:18 INFO  Alignment:138 - Removed: (#char=1453,1461, rdf:type, nif:Phrase)
2016-06-21 16:22:18 INFO  Alignment:152 - Removed: (#char=1453,1461, itsrdf:taClassRef, null)
2016-06-21 16:22:18 INFO  Alignment:156 - Removed: (#char=1453,1461, itsrdf:taIdentRef, null)
</pre>

<p>
This corresponds to two annotations:
</p>
<ul class="org-ul">
<li>&lt;#char=1444,1461&gt; found by Named Entity Recognition: "Margaret Thatcher" detected as the politician, with link to DBpedia (longer; correct)
</li>
<li>&lt;#char=1453,1461&gt; found by Entity Linking: "Thatcher" detected as a "roof builder" with link to Bbelnet (shorter; incorrect)
</li>
</ul>

<p>
The Entity Alignment service prefers the longer annotation, and removes 3 properties from the shorter annotation.
What is left in the RDF is this:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;#char=1453,1461&gt;</span>
        <span style="color: #a020f0;">a</span>                     <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">Word</span> ;
        <span style="color: #0000ff;">&lt;http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-annotation#taIdentConf&gt;</span>
                <span style="color: #8b2252;">"0.0"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
        <span style="color: #0000ff;">&lt;http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-annotation#taIdentProv&gt;</span>
                <span style="color: #0000ff;">&lt;http://babelfy.org/&gt;</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">anchorOf</span>          <span style="color: #8b2252;">"Thatcher"</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">beginIndex</span>        <span style="color: #8b2252;">"1453"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">endIndex</span>          <span style="color: #8b2252;">"1461"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">referenceContext</span>  <span style="color: #0000ff;">&lt;#char=0,2898&gt;</span><span style="color: #b22222;"> .</span>

<span style="color: #0000ff;">&lt;#char=1444,1461&gt;</span>
        <span style="color: #a020f0;">a</span>                     <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">Phrase</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">anchorOf</span>          <span style="color: #8b2252;">"Margaret Thatcher"</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">beginIndex</span>        <span style="color: #8b2252;">"1444"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">endIndex</span>          <span style="color: #8b2252;">"1461"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">referenceContext</span>  <span style="color: #0000ff;">&lt;#char=0,2898&gt;</span><span style="color: #b22222;"> ;</span>
        <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taClassRef</span>        <span style="color: #228b22;">nerd:</span><span style="color: #008b8b;">Person</span> ;
        <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taIdentRef</span>        <span style="color: #228b22;">dbr:</span><span style="color: #008b8b;">Margaret_Thatcher</span> <span style="color: #228b22;">.</span>

<span style="color: #228b22;">dbr:</span>Margaret_Thatcher
        <span style="color: #a020f0;">a</span>          <span style="color: #228b22;">foaf:</span><span style="color: #008b8b;">Person</span> , <span style="color: #228b22;">dbo:</span><span style="color: #008b8b;">Person</span> , <span style="color: #228b22;">nerd:</span><span style="color: #008b8b;">Person</span> ;
        <span style="color: #228b22;">foaf:</span><span style="color: #008b8b;">name</span>  <span style="color: #8b2252;">"Margaret Thatcher"</span> .
</pre>
</div>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="done DONE">DONE</span> Also remove taIdentConf, taIdentProv</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
In the example above, <code>taClassRef</code> and <code>taIdentRef</code> were removed. 
This makes the other two props <code>nif-ann:taIdentConf</code> and <code>nif-ann:taIdentProv</code> useless.
Remove them too.
</p>
</div>
</div>

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="done DONE">DONE</span> Leave Dependency Links</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Entity Alignment also seems to remove the dependency links, eg:
</p>
<pre class="example">
&lt;#char=1444,1452&gt; nif:dependency          &lt;#char=1453,1461&gt;
&lt;#char=1444,1452&gt; upf-deep:deepDependency &lt;#char=1453,1461&gt;
</pre>

<p>
However, this can make the dependency and FrameNet graphs disconnected. So leave the dependencies alone.
</p>
</div>
</div>

<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="todo TODO">TODO</span> Use Prefixes in alignment.log</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
I shortened the excerpt from alignment.log above to improve readability:
substituted the defined prefixes, and used the SIMMO URL as base (i.e. used relative URLs starting with hash)
It would be very useful if alignment.log uses the same shortenings to improve readability.
</p>

<p>
This is a completely cosmetic issue, we can cancel it.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Summarization Service</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-06-28 Tue&gt;</span></span> looked at <a href="http://grinder1.multisensorproject.eu/cepfiles/rdf_validation/concept_with_scores_16_06_2016/2c9d5c-CONCEPT_EXTRACTION-16-6-2016.ttl">2c9d5c-CONCEPT_EXTRACTION-16-6-2016.ttl</a> (concept_with_scores)
</p>

<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;#char=0,11&gt;</span>
        <span style="color: #a020f0;">a</span>                        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">Phrase</span> ;
        <span style="color: #0000ff;">&lt;http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-annotation#taIdentConf&gt;</span>
                <span style="color: #8b2252;">"0.0"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
        <span style="color: #0000ff;">&lt;http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-annotation#taIdentProv&gt;</span>
                <span style="color: #0000ff;">&lt;http://babelfy.org/&gt;</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">beginIndex</span>           <span style="color: #8b2252;">"0"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">dependency</span>           <span style="color: #0000ff;">&lt;#char=29,38&gt;</span><span style="color: #b22222;"> ;</span>
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">endIndex</span>             <span style="color: #8b2252;">"11"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">lemma</span>                <span style="color: #8b2252;">"open_source"</span> ;
        <span style="color: #228b22;">nif:</span>literalAnnotation
          <span style="color: #8b2252;">"surf=spos=NN"</span> ,
          <span style="color: #8b2252;">"rel==dpos=NN|end_string=11|start_string=0|id0=1|number=SG|word=open_source|connect_check=OK|vn=open_source"</span> ,
          <span style="color: #8b2252;">"deep=spos=NN"</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">oliaLink</span>             <span style="color: #228b22;">upf-dep-syn:</span><span style="color: #008b8b;">NAME</span> , <span style="color: #228b22;">upf-deep:</span><span style="color: #008b8b;">NAME</span> , <span style="color: #0000ff;">&lt;#char=0,11_fe&gt;</span><span style="color: #b22222;"> , </span><span style="color: #228b22;">penn:</span><span style="color: #008b8b;">NNP</span><span style="color: #b22222;"> ;</span>
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">referenceContext</span>     <span style="color: #0000ff;">&lt;#char=0,5625&gt;</span><span style="color: #b22222;"> ;</span>
        <span style="color: #228b22;">upf-deep:</span><span style="color: #008b8b;">deepDependency</span>  <span style="color: #0000ff;">&lt;#char=29,38&gt;</span><span style="color: #b22222;"> ;</span>
        <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taClassRef</span>           <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">GenericConcept</span> ;
        <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taIdentRef</span>           <span style="color: #228b22;">bn:</span><span style="color: #008b8b;">s01157392n</span> .
</pre>
</div>
</div>
