validation.org
** Content Alignment
The Content Alignment Pipeline (CAP) is a service that executes on KB data and finds articles that are similar or contradictory to the source article.
It is *not* executed as part of the SIMMO pipeline, but periodically.

<2016-07-20 Wed>: selected repo *multisensor-test* and checked http://multisensor.ontotext.com/resource?uri=http://data.multisensorproject.eu/CAP/7b91365a-af00-4518-a7e7-f187f3cd44c1 
- Everything's done except "ms:score instead of fise:confidence" (Babis) and "add to Ontology" (Vladimir).
- Checked there are motivations of both kinds:
  #+BEGIN_SRC sparql
select ?mot (count(*) as ?c) where { 
 graph <http://data.multisensorproject.eu/CAP> {?x oa:motivatedBy ?mot}
} group by ?mot
#+END_SRC
  ms:linking-similar: 828, ms:linking-contradictory: 860
- one contradictory CAP annotation is [[http://multisensor.ontotext.com/resource?uri%3Dhttp:%2F%2Fdata.multisensorproject.eu%2FCAP%2F007e1c1e-85b4-481a-a838-0e242c2afb8c][CAP/007e1c1e-85b4-481a-a838-0e242c2afb8c]]
  It talks about these two:
  #+BEGIN_SRC sparql
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX nif: <http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-core#>
select ?desc ?text {
    values ?x {
        <http://data.multisensorproject.eu/content/7d76ef5e787e830b081d149d05359c21cc5a9835>
        <http://data.multisensorproject.eu/content/d2b116e9c5422fda256da2913738ac000ba7b30c>
    }
    ?x dc:description ?desc.
    ?y nif:sourceUrl ?x; nif:isString ?text
}
#+END_SRC
  - One is about "How an Apple Watch can ruin your life"
  - The other about "Employees and executives win mobility and flexibility with the SH10 TaskBook of SOREDI Touch Systems GmbH"
  Guess this is sort of contradictory: one hates one IT product, the other one praises another IT product :-)

*** CAP Old Model
<2016-06-28 Tue> checked [[http://mklab2.iti.gr/multisensor/index.php/CAP:_Specification_of_the_service][CAP:_Specification_of_the_service]]. It proposes the following model:

#+BEGIN_SRC Turtle
<http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticles>
  a oa:Annotation ;
  oa:hasTarget <http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304> ;
  oa:hasBody        
    <http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-1> ,
    <http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-2> ;
  oa:motivatedBy oa:tagging ;
  oa:annotatedBy <http://data.multisensorproject.eu/agent/CAPAgent> ;
  oa:annotatedAt "2016-01-11T12:00:00"^^xsd:dateTime .

<http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-1>
  a oa:SemanticTag ;
  skos:related <http://data.multisensorproject.eu/content/ca34bb35770bfa55434a0689d64e1e6a60611047> ;
  fise:confidence 0.862 .

<http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-2>
  a oa:SemanticTag ;
  skos:related <http://data.multisensorproject.eu/content/57e07befbda355c2eca2ee521926071ee9f5c719> ;
  fise:confidence 0.795 .

<http://data.multisensorproject.eu/agent/CAPAgent>
  a prov:SoftwareAgent ;
  foaf:name "Content Alignment Pipeline v1.0" .
#+END_SRC

Each annotation is symmetric, so it's written twice: in the SIMMO graphs of each of the two SIMMOs.
This complicates data management, because both of these graphs need to be updated.

