validation.html

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Content Alignment</h3>
<div class="outline-text-3" id="text-2-5">
<p>
The Content Alignment Pipeline (CAP) is a service that executes on KB data and finds articles that are similar or contradictory to the source article.
It is <b>not</b> executed as part of the SIMMO pipeline, but periodically.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-07-20 Wed&gt;</span></span>: selected repo <b>multisensor-test</b> and checked <a href="http://multisensor.ontotext.com/resource?uri=http://data.multisensorproject.eu/CAP/7b91365a-af00-4518-a7e7-f187f3cd44c1">http://multisensor.ontotext.com/resource?uri=http://data.multisensorproject.eu/CAP/7b91365a-af00-4518-a7e7-f187f3cd44c1</a> 
</p>
<ul class="org-ul">
<li>Everything's done except "ms:score instead of fise:confidence" (Babis) and "add to Ontology" (Vladimir).
</li>
<li>Checked there are motivations of both kinds:
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">select</span> <span style="color: #a0522d;">?mot</span> (count(*) <span style="color: #a020f0;">as</span> <span style="color: #a0522d;">?c</span>) <span style="color: #a020f0;">where</span> { 
 <span style="color: #a020f0;">graph</span> <span style="color: #008b8b;">&lt;http://data.multisensorproject.eu/CAP&gt;</span> {<span style="color: #a0522d;">?x</span> oa:motivatedBy <span style="color: #a0522d;">?mot</span>}
} <span style="color: #a020f0;">group</span> <span style="color: #a020f0;">by</span> <span style="color: #a0522d;">?mot</span>
</pre>
</div>
<p>
ms:linking-similar: 828, ms:linking-contradictory: 860
</p>
</li>
<li>one contradictory CAP annotation is <a href="http://multisensor.ontotext.com/resource?uri=http://data.multisensorproject.eu/CAP/007e1c1e-85b4-481a-a838-0e242c2afb8c">CAP/007e1c1e-85b4-481a-a838-0e242c2afb8c</a>
  It talks about these two:
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">PREFIX</span> dc: <span style="color: #008b8b;">&lt;http://purl.org/dc/elements/1.1/&gt;</span>
<span style="color: #a020f0;">PREFIX</span> nif: <span style="color: #008b8b;">&lt;http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-core#&gt;</span>
<span style="color: #a020f0;">select</span> <span style="color: #a0522d;">?desc</span> <span style="color: #a0522d;">?text</span> {
    <span style="color: #a020f0;">values</span> <span style="color: #a0522d;">?x</span> {
        <span style="color: #008b8b;">&lt;http://data.multisensorproject.eu/content/7d76ef5e787e830b081d149d05359c21cc5a9835&gt;</span>
        <span style="color: #008b8b;">&lt;http://data.multisensorproject.eu/content/d2b116e9c5422fda256da2913738ac000ba7b30c&gt;</span>
    }
    <span style="color: #a0522d;">?x</span> dc:description <span style="color: #a0522d;">?desc</span>.
    <span style="color: #a0522d;">?y</span> nif:sourceUrl <span style="color: #a0522d;">?x</span>; nif:isString <span style="color: #a0522d;">?text</span>
}
</pre>
</div>
<ul class="org-ul">
<li>One is about "How an Apple Watch can ruin your life"
</li>
<li>The other about "Employees and executives win mobility and flexibility with the SH10 TaskBook of SOREDI Touch Systems GmbH"
</li>
</ul>
<p>
Guess this is sort of contradictory: one hates one IT product, the other one praises another IT product :-)
</p>
</li>
</ul>
</div>

<div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1">CAP Old Model</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-06-28 Tue&gt;</span></span> checked <a href="http://mklab2.iti.gr/multisensor/index.php/CAP:_Specification_of_the_service">CAP:_Specification_of_the_service</a>. It proposes the following model:
</p>

<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticles&gt;</span>
  <span style="color: #a020f0;">a</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">Annotation</span> ;
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">hasTarget</span> <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304&gt;</span> ;
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">hasBody</span>        
    <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-1&gt;</span><span style="color: #b22222;"> ,</span>
    <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-2&gt;</span><span style="color: #b22222;"> ;</span>
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">motivatedBy</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">tagging</span> ;
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">annotatedBy</span> <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/agent/CAPAgent&gt;</span> ;
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">annotatedAt</span> <span style="color: #8b2252;">"2016-01-11T12:00:00"</span><span style="color: #008b8b;">^^xsd:dateTime</span> <span style="color: #228b22;">.</span>

<span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-1&gt;</span>
  <span style="color: #a020f0;">a</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">SemanticTag</span> ;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">related</span> <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/ca34bb35770bfa55434a0689d64e1e6a60611047&gt;</span> ;
  <span style="color: #228b22;">fise:</span><span style="color: #008b8b;">confidence</span> 0.862 <span style="color: #228b22;">.</span>

<span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-2&gt;</span>
  <span style="color: #a020f0;">a</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">SemanticTag</span> ;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">related</span> <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/57e07befbda355c2eca2ee521926071ee9f5c719&gt;</span> ;
  <span style="color: #228b22;">fise:</span><span style="color: #008b8b;">confidence</span> 0.795 <span style="color: #228b22;">.</span>

<span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/agent/CAPAgent&gt;</span>
  <span style="color: #a020f0;">a</span> <span style="color: #228b22;">prov:</span><span style="color: #008b8b;">SoftwareAgent</span> ;
  <span style="color: #228b22;">foaf:</span><span style="color: #008b8b;">name</span> <span style="color: #8b2252;">"Content Alignment Pipeline v1.0"</span> .
</pre>
</div>

<p>
Each annotation is symmetric, so it's written twice: in the SIMMO graphs of each of the two SIMMOs.
This complicates data management, because both of these graphs need to be updated.
</p>
</div>
</div>
