validation.org
** DONE Content Translation
Scenario: we have a SIMMO in original language ES that is machine-translated to EN & DE. 
- All textual elements are translated: title, description, body.
  - The example below also shows subject & keywords in different languages. If you can only produce them in EN, that's fine
- However, video ASR text is not translated.
- Both original and translations are annotated with NIF.
We want to record all NIF information against original and translated separately, so there's no confusion.
If the article includes multimedia, we want to attach it only to the original, to avoid data duplication.

Solution: we need separate roots (foaf:Document), so we store the original and translation(s) in separate named graphs.
- the translated-content graph has language-specific suffix; the original-content graph does not have such suffix
- the translated content has link ~bibo:translationOf~ to the original

Root:
#+BEGIN_SRC Turtle
# ES original
graph ms-content:156e0d {
  ms-content:156e0d a foaf:Document ;
    dbp:countryCode  "ES" ;
    dc:creator       "Alberto Iglesias Fraga" ;
    dc:date          "2016-07-28T23:45:07.000+02:00"^^xsd:dateTime ;
    dc:description   "SONY ha iniciado negociaciones con Murata Manufacturing para la venta de su negocio de baterías. La operación culminará en marzo de 2017...";
    dc:language      "es" ;
    dc:source        "cloud.ticbeat.com" ;
    dc:subject       "Economía, Negocios y Finanzas" ;
    dc:title         "SONY se desprenderá de su negocio de baterías" ;
    dc:type          "article" ;
    schema:keywords  "Sony, baterías, Murata Manufacturing";
    dct:source       <http://feedproxy.google.com/~r/rwwes/~3/z2KuGYx6FiY/> .

# EN translation
graph ms-content:156e0d-en {
  ms-content:156e0d-en a foaf:Document ;
    bibo:translationOf ms-content:156e0d; # IMPORTANT!
    dbp:countryCode   "ES" ;
    dc:creator        "Alberto Iglesias Fraga" ;
    dc:date           "2016-07-28T23:45:07.000+02:00"^^xsd:dateTime ;
    dc:description    "SONY has begun negotiations with Murata Manufacturing for the sale of its battery business. The operation will culminate in March 2017 ..." ;
    dc:language       "en" ;
    dc:source         "cloud.ticbeat.com" ;
    dc:subject        "Economy, Business & Finance" ;
    dc:title          "SONY is clear from its battery business" ;
    dc:type           "article" ;
    schema:keywords   "Sony, batteries, Murata Manufacturing";
    dct:source        <http://feedproxy.google.com/~r/rwwes/~3/z2KuGYx6FiY/> .
}

# DE translation
graph ms-content:156e0d-de {
  ms-content:156e0d-de a foaf:Document ;
    bibo:translationOf ms-content:156e0d; # IMPORTANT!
    dbp:countryCode   "ES" ;
    dc:creator        "Alberto Iglesias Fraga" ;
    dc:date           "2016-07-28T23:45:07.000+02:00"^^xsd:dateTime ;
    dc:description    "SONY hat die Verhandlungen mit Murata Manufacturing für den Verkauf seiner Batterie-Geschäft begonnen. Die Operation wird März 2017 gipfeln ..." ;
    dc:language       "de" ;
    dc:source         "cloud.ticbeat.com" ;
    dc:subject        "Economy, Business & Finanzen" ;
    dc:title          "SONY ist klar von seiner Batteriegeschäft" ;
    dc:type           "article" ;
    schema:keywords   "Sony, Batterien, Murata Manufacturing";
    dct:source        <http://feedproxy.google.com/~r/rwwes/~3/z2KuGYx6FiY/> .
}
#+END_SRC

Context:
#+BEGIN_SRC Turtle
# ES original
graph ms-content:156e0d {
  <http://data.multisensorproject.eu/content/156e0d#char=0,2131> a nif:Context ;
    ms:fluency       "1.22"^^xsd:double ;
    ms:richness      "1.86"^^xsd:double ;
    ms:technicality  "2.78"^^xsd:double ;
    nif:beginIndex   "0"^^xsd:nonNegativeInteger ;
    nif:endIndex     "2131"^^xsd:nonNegativeInteger ;
    nif:isString     "SONY se desprenderá de su negocio de baterías\n\nSONY sigue inmersa en la profunda reestructuración..." ;
    nif:sourceUrl    ms-content:b156e0d .
}

# EN translation
graph ms-content:156e0d-en {
  <http://data.multisensorproject.eu/content/156e0d-en#char=0,1800> a nif:Context ;
    ms:fluency       "1.25"^^xsd:double ; # hopefully will be similar to original, but won't be identical
    ms:richness      "1.81"^^xsd:double ;
    ms:technicality  "2.70"^^xsd:double ;
    nif:beginIndex   "0"^^xsd:nonNegativeInteger ;
    nif:endIndex     "1800"^^xsd:nonNegativeInteger ; # Assuming EN comes out shorter than ES
    nif:isString     "SONY is clear from its battery business\n\nSONY still immersed in deep restructuring ..." ;
    nif:sourceUrl    ms-content:b156e0d-en .
}

# EN translation
graph ms-content:156e0d-de {
  <http://data.multisensorproject.eu/content/156e0d-de#char=0,2200> a nif:Context ;
    ms:fluency       "1.12"^^xsd:double ; # hopefully will be similar to original, but won't be identical
    ms:richness      "1.56"^^xsd:double ;
    ms:technicality  "2.41"^^xsd:double ;
    nif:beginIndex   "0"^^xsd:nonNegativeInteger ;
    nif:endIndex     "2200"^^xsd:nonNegativeInteger ; # Assuming DE comes out longer than ES
    nif:isString     "SONY ist von seiner Batterie-Geschäft\n\nSONY klar immer noch in einer tiefen Umstrukturierung getaucht ..." ;
    nif:sourceUrl    ms-content:b156e0d-de .
}
#+END_SRC

Some NIF annotations:
#+BEGIN_SRC Turtle
# ES original
graph ms-content:156e0d {
  <http://data.multisensorproject.eu/content/156e0d#char=1199,1224> a nif:Phrase ;
    nif:anchorOf           "batería de iones de litio" ;
    nif:beginIndex         "1199"^^xsd:nonNegativeInteger ;
    nif:endIndex           "1224"^^xsd:nonNegativeInteger ;
    nif:referenceContext   <http://data.multisensorproject.eu/content/b156e0d#char=0,2131> ;
    nif-ann:taIdentConf    "1.0"^^xsd:double ;
    nif-ann:taIdentProv    <http://babelfy.org/> ;
    its:taClassRef         ms:GenericConcept ;
    its:taIdentRef         bn:s01289274n .
}

# The BN labels are submitted in the SIMMO graph but stored in the default graph, thus the same for all languages
bn:s01289274n skos:prefLabel "LiIon"@de, "Li-ion cell"@en, "Batteries lithium-ion"@fr, "Литиево-йонна батерия"@bg .

# EN translation
graph ms-content:156e0d-en {
  <http://data.multisensorproject.eu/content/156e0d-en#char=1100,1119> a nif:Phrase ;
    nif:anchorOf           "lithium ion battery" ;
    nif:beginIndex         "1100"^^xsd:nonNegativeInteger ;
    nif:endIndex           "1119"^^xsd:nonNegativeInteger ;
    nif:referenceContext   <http://data.multisensorproject.eu/content/b156e0d-en#char=0,1800> ;
    nif-ann:taIdentConf    "1.0"^^xsd:double ;
    nif-ann:taIdentProv    <http://babelfy.org/> ;
    its:taClassRef         ms:GenericConcept ;
    its:taIdentRef         bn:s01289274n .
}

# DE translation
graph ms-content:156e0d-de {
  <http://data.multisensorproject.eu/content/156e0d-en#char=1200,1218> a nif:Phrase ;
    nif:anchorOf           "Lithium-Ionen-Akku" ;
    nif:beginIndex         "1200"^^xsd:nonNegativeInteger ;
    nif:endIndex           "1218"^^xsd:nonNegativeInteger ;
    nif:referenceContext   <http://data.multisensorproject.eu/content/b156e0d-de#char=0,2200> ;
    nif-ann:taIdentConf    "1.0"^^xsd:double ;
    nif-ann:taIdentProv    <http://babelfy.org/> ;
    its:taClassRef         ms:GenericConcept ;
    its:taIdentRef         bn:s01289274n .
}
#+END_SRC

Multimedia is only present in the original-content graph:
#+BEGIN_SRC Turtle
graph ms-content:156e0d {
  ms-content:156e0d dct:hasPart 
    <http://cloud.ticbeat.com/2016/07/sony-baterías-explosión.mp4>,
    <http://cloud.ticbeat.com/2016/07/sony-batería.jpg> 

  <http://cloud.ticbeat.com/2016/07/sony-baterías-explosión.mp4> 
    a dctype:MovingImage;
    dc:format "video/mp4".

  <http://cloud.ticbeat.com/2016/07/sony-batería.jpg> 
    a dctype:StillImage;
    dc:format "image/jpeg".
}
#+END_SRC

Files:
- old: http://grinder1.multisensorproject.eu/cepfiles/multiTest/validated/
- new: http://grinder1.multisensorproject.eu/cepfiles/multiTest/41d28d-GERMAN_SIMMMO-5-9-2016.ttl and http://grinder1.multisensorproject.eu/cepfiles/multiTest/41d28d-CONTEXT_EXTRACTION-5-9-2016.ttl

Checking:
- added prefixes ~bibo: upf-pos-spa: upf-dep-deu: upf-pos-deu:~
  (before we only had ~upf-dep-spa:~). Please update.
- Would also be nice to translate ~schema:keywords~
  (currently is "preisportal, vergleich, check24, verivox, billiger, idealo, geizhals, tricks, betrug, geld" in both DE original and EN translation)
- All the rest is ok

