validation.html

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="done DONE">DONE</span> Content Translation</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Scenario: we have a SIMMO in original language ES that is machine-translated to EN &amp; DE. 
</p>
<ul class="org-ul">
<li>All textual elements are translated: title, description, body.
<ul class="org-ul">
<li>The example below also shows subject &amp; keywords in different languages. If you can only produce them in EN, that's fine
</li>
</ul>
</li>
<li>However, video ASR text is not translated.
</li>
<li>Both original and translations are annotated with NIF.
</li>
</ul>
<p>
We want to record all NIF information against original and translated separately, so there's no confusion.
If the article includes multimedia, we want to attach it only to the original, to avoid data duplication.
</p>

<p>
Solution: we need separate roots (foaf:Document), so we store the original and translation(s) in separate named graphs.
</p>
<ul class="org-ul">
<li>the translated-content graph has language-specific suffix; the original-content graph does not have such suffix
</li>
<li>the translated content has link <code>bibo:translationOf</code> to the original
</li>
</ul>

<p>
Root:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #b22222;"># ES original</span>
graph <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d</span> {
  <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">foaf:</span><span style="color: #008b8b;">Document</span> ;
    <span style="color: #228b22;">dbp:</span><span style="color: #008b8b;">countryCode</span>  <span style="color: #8b2252;">"ES"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">creator</span>       <span style="color: #8b2252;">"Alberto Iglesias Fraga"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">date</span>          <span style="color: #8b2252;">"2016-07-28T23:45:07.000+02:00"</span><span style="color: #008b8b;">^^xsd:dateTime</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">description</span>   <span style="color: #8b2252;">"SONY ha iniciado negociaciones con Murata Manufacturing para la venta de su negocio de bater&#237;as. La operaci&#243;n culminar&#225; en marzo de 2017..."</span>;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">language</span>      <span style="color: #8b2252;">"es"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">source</span>        <span style="color: #8b2252;">"cloud.ticbeat.com"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">subject</span>       <span style="color: #8b2252;">"Econom&#237;a, Negocios y Finanzas"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">title</span>         <span style="color: #8b2252;">"SONY se desprender&#225; de su negocio de bater&#237;as"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">type</span>          <span style="color: #8b2252;">"article"</span> ;
    <span style="color: #228b22;">schema:</span><span style="color: #008b8b;">keywords</span>  <span style="color: #8b2252;">"Sony, bater&#237;as, Murata Manufacturing"</span>;
    <span style="color: #228b22;">dct:</span><span style="color: #008b8b;">source</span>       <span style="color: #0000ff;">&lt;http://feedproxy.google.com/~r/rwwes/~3/z2KuGYx6FiY/&gt;</span> .

<span style="color: #b22222;"># EN translation</span>
graph <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d-en</span> {
  <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d-en</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">foaf:</span><span style="color: #008b8b;">Document</span> ;
    <span style="color: #228b22;">bibo:</span><span style="color: #008b8b;">translationOf</span> <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d</span>; <span style="color: #b22222;"># IMPORTANT!</span>
    <span style="color: #228b22;">dbp:</span><span style="color: #008b8b;">countryCode</span>   <span style="color: #8b2252;">"ES"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">creator</span>        <span style="color: #8b2252;">"Alberto Iglesias Fraga"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">date</span>           <span style="color: #8b2252;">"2016-07-28T23:45:07.000+02:00"</span><span style="color: #008b8b;">^^xsd:dateTime</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">description</span>    <span style="color: #8b2252;">"SONY has begun negotiations with Murata Manufacturing for the sale of its battery business. The operation will culminate in March 2017 ..."</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">language</span>       <span style="color: #8b2252;">"en"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">source</span>         <span style="color: #8b2252;">"cloud.ticbeat.com"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">subject</span>        <span style="color: #8b2252;">"Economy, Business &amp; Finance"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">title</span>          <span style="color: #8b2252;">"SONY is clear from its battery business"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">type</span>           <span style="color: #8b2252;">"article"</span> ;
    <span style="color: #228b22;">schema:</span><span style="color: #008b8b;">keywords</span>   <span style="color: #8b2252;">"Sony, batteries, Murata Manufacturing"</span>;
    <span style="color: #228b22;">dct:</span><span style="color: #008b8b;">source</span>        <span style="color: #0000ff;">&lt;http://feedproxy.google.com/~r/rwwes/~3/z2KuGYx6FiY/&gt;</span> .
}

<span style="color: #b22222;"># DE translation</span>
graph <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d-de</span> {
  <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d-de</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">foaf:</span><span style="color: #008b8b;">Document</span> ;
    <span style="color: #228b22;">bibo:</span><span style="color: #008b8b;">translationOf</span> <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d</span>; <span style="color: #b22222;"># IMPORTANT!</span>
    <span style="color: #228b22;">dbp:</span><span style="color: #008b8b;">countryCode</span>   <span style="color: #8b2252;">"ES"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">creator</span>        <span style="color: #8b2252;">"Alberto Iglesias Fraga"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">date</span>           <span style="color: #8b2252;">"2016-07-28T23:45:07.000+02:00"</span><span style="color: #008b8b;">^^xsd:dateTime</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">description</span>    <span style="color: #8b2252;">"SONY hat die Verhandlungen mit Murata Manufacturing f&#252;r den Verkauf seiner Batterie-Gesch&#228;ft begonnen. Die Operation wird M&#228;rz 2017 gipfeln ..."</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">language</span>       <span style="color: #8b2252;">"de"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">source</span>         <span style="color: #8b2252;">"cloud.ticbeat.com"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">subject</span>        <span style="color: #8b2252;">"Economy, Business &amp; Finanzen"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">title</span>          <span style="color: #8b2252;">"SONY ist klar von seiner Batteriegesch&#228;ft"</span> ;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">type</span>           <span style="color: #8b2252;">"article"</span> ;
    <span style="color: #228b22;">schema:</span><span style="color: #008b8b;">keywords</span>   <span style="color: #8b2252;">"Sony, Batterien, Murata Manufacturing"</span>;
    <span style="color: #228b22;">dct:</span><span style="color: #008b8b;">source</span>        <span style="color: #0000ff;">&lt;http://feedproxy.google.com/~r/rwwes/~3/z2KuGYx6FiY/&gt;</span> .
}
</pre>
</div>

<p>
Context:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #b22222;"># ES original</span>
graph <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d</span> {
  <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/156e0d#char=0,2131&gt;</span><span style="color: #b22222;"> </span><span style="color: #a020f0;">a</span><span style="color: #b22222;"> </span><span style="color: #228b22;">nif:</span><span style="color: #008b8b;">Context</span><span style="color: #b22222;"> ;</span>
    <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">fluency</span>       <span style="color: #8b2252;">"1.22"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
    <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">richness</span>      <span style="color: #8b2252;">"1.86"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
    <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">technicality</span>  <span style="color: #8b2252;">"2.78"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">beginIndex</span>   <span style="color: #8b2252;">"0"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">endIndex</span>     <span style="color: #8b2252;">"2131"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">isString</span>     <span style="color: #8b2252;">"SONY se desprender&#225; de su negocio de bater&#237;as\n\nSONY sigue inmersa en la profunda reestructuraci&#243;n..."</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">sourceUrl</span>    <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">b156e0d</span> .
}

<span style="color: #b22222;"># EN translation</span>
graph <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d-en</span> {
  <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/156e0d-en#char=0,1800&gt;</span><span style="color: #b22222;"> </span><span style="color: #a020f0;">a</span><span style="color: #b22222;"> </span><span style="color: #228b22;">nif:</span><span style="color: #008b8b;">Context</span><span style="color: #b22222;"> ;</span>
    <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">fluency</span>       <span style="color: #8b2252;">"1.25"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ; <span style="color: #b22222;"># hopefully will be similar to original, but won't be identical</span>
    <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">richness</span>      <span style="color: #8b2252;">"1.81"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
    <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">technicality</span>  <span style="color: #8b2252;">"2.70"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">beginIndex</span>   <span style="color: #8b2252;">"0"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">endIndex</span>     <span style="color: #8b2252;">"1800"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ; <span style="color: #b22222;"># Assuming EN comes out shorter than ES</span>
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">isString</span>     <span style="color: #8b2252;">"SONY is clear from its battery business\n\nSONY still immersed in deep restructuring ..."</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">sourceUrl</span>    <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">b156e0d-en</span> .
}

<span style="color: #b22222;"># EN translation</span>
graph <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d-de</span> {
  <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/156e0d-de#char=0,2200&gt;</span><span style="color: #b22222;"> </span><span style="color: #a020f0;">a</span><span style="color: #b22222;"> </span><span style="color: #228b22;">nif:</span><span style="color: #008b8b;">Context</span><span style="color: #b22222;"> ;</span>
    <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">fluency</span>       <span style="color: #8b2252;">"1.12"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ; <span style="color: #b22222;"># hopefully will be similar to original, but won't be identical</span>
    <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">richness</span>      <span style="color: #8b2252;">"1.56"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
    <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">technicality</span>  <span style="color: #8b2252;">"2.41"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">beginIndex</span>   <span style="color: #8b2252;">"0"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">endIndex</span>     <span style="color: #8b2252;">"2200"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ; <span style="color: #b22222;"># Assuming DE comes out longer than ES</span>
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">isString</span>     <span style="color: #8b2252;">"SONY ist von seiner Batterie-Gesch&#228;ft\n\nSONY klar immer noch in einer tiefen Umstrukturierung getaucht ..."</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">sourceUrl</span>    <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">b156e0d-de</span> .
}
</pre>
</div>

<p>
Some NIF annotations:
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #b22222;"># ES original</span>
graph <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d</span> {
  <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/156e0d#char=1199,1224&gt;</span><span style="color: #b22222;"> </span><span style="color: #a020f0;">a</span><span style="color: #b22222;"> </span><span style="color: #228b22;">nif:</span><span style="color: #008b8b;">Phrase</span><span style="color: #b22222;"> ;</span>
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">anchorOf</span>           <span style="color: #8b2252;">"bater&#237;a de iones de litio"</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">beginIndex</span>         <span style="color: #8b2252;">"1199"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">endIndex</span>           <span style="color: #8b2252;">"1224"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">referenceContext</span>   <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/b156e0d#char=0,2131&gt;</span><span style="color: #b22222;"> ;</span>
    <span style="color: #228b22;">nif-ann:</span><span style="color: #008b8b;">taIdentConf</span>    <span style="color: #8b2252;">"1.0"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
    <span style="color: #228b22;">nif-ann:</span><span style="color: #008b8b;">taIdentProv</span>    <span style="color: #0000ff;">&lt;http://babelfy.org/&gt;</span> ;
    <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taClassRef</span>         <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">GenericConcept</span> ;
    <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taIdentRef</span>         <span style="color: #228b22;">bn:</span><span style="color: #008b8b;">s01289274n</span> .
}

<span style="color: #b22222;"># The BN labels are submitted in the SIMMO graph but stored in the default graph, thus the same for all languages</span>
<span style="color: #228b22;">bn:</span><span style="color: #008b8b;">s01289274n</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"LiIon"</span>@de, <span style="color: #8b2252;">"Li-ion cell"</span>@en, <span style="color: #8b2252;">"Batteries lithium-ion"</span>@fr, <span style="color: #8b2252;">"&#1051;&#1080;&#1090;&#1080;&#1077;&#1074;&#1086;-&#1081;&#1086;&#1085;&#1085;&#1072; &#1073;&#1072;&#1090;&#1077;&#1088;&#1080;&#1103;"</span>@bg .

<span style="color: #b22222;"># EN translation</span>
graph <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d-en</span> {
  <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/156e0d-en#char=1100,1119&gt;</span><span style="color: #b22222;"> </span><span style="color: #a020f0;">a</span><span style="color: #b22222;"> </span><span style="color: #228b22;">nif:</span><span style="color: #008b8b;">Phrase</span><span style="color: #b22222;"> ;</span>
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">anchorOf</span>           <span style="color: #8b2252;">"lithium ion battery"</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">beginIndex</span>         <span style="color: #8b2252;">"1100"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">endIndex</span>           <span style="color: #8b2252;">"1119"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">referenceContext</span>   <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/b156e0d-en#char=0,1800&gt;</span><span style="color: #b22222;"> ;</span>
    <span style="color: #228b22;">nif-ann:</span><span style="color: #008b8b;">taIdentConf</span>    <span style="color: #8b2252;">"1.0"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
    <span style="color: #228b22;">nif-ann:</span><span style="color: #008b8b;">taIdentProv</span>    <span style="color: #0000ff;">&lt;http://babelfy.org/&gt;</span> ;
    <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taClassRef</span>         <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">GenericConcept</span> ;
    <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taIdentRef</span>         <span style="color: #228b22;">bn:</span><span style="color: #008b8b;">s01289274n</span> .
}

<span style="color: #b22222;"># DE translation</span>
graph <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d-de</span> {
  <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/156e0d-en#char=1200,1218&gt;</span><span style="color: #b22222;"> </span><span style="color: #a020f0;">a</span><span style="color: #b22222;"> </span><span style="color: #228b22;">nif:</span><span style="color: #008b8b;">Phrase</span><span style="color: #b22222;"> ;</span>
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">anchorOf</span>           <span style="color: #8b2252;">"Lithium-Ionen-Akku"</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">beginIndex</span>         <span style="color: #8b2252;">"1200"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">endIndex</span>           <span style="color: #8b2252;">"1218"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
    <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">referenceContext</span>   <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/b156e0d-de#char=0,2200&gt;</span><span style="color: #b22222;"> ;</span>
    <span style="color: #228b22;">nif-ann:</span><span style="color: #008b8b;">taIdentConf</span>    <span style="color: #8b2252;">"1.0"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
    <span style="color: #228b22;">nif-ann:</span><span style="color: #008b8b;">taIdentProv</span>    <span style="color: #0000ff;">&lt;http://babelfy.org/&gt;</span> ;
    <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taClassRef</span>         <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">GenericConcept</span> ;
    <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taIdentRef</span>         <span style="color: #228b22;">bn:</span><span style="color: #008b8b;">s01289274n</span> .
}
</pre>
</div>

<p>
Multimedia is only present in the original-content graph:
</p>
<div class="org-src-container">

<pre class="src src-Turtle">graph <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d</span> {
  <span style="color: #228b22;">ms-content:</span><span style="color: #008b8b;">156e0d</span> <span style="color: #228b22;">dct:</span><span style="color: #008b8b;">hasPart</span> 
    <span style="color: #0000ff;">&lt;http://cloud.ticbeat.com/2016/07/sony-bater&#237;as-explosi&#243;n.mp4&gt;</span>,
    <span style="color: #0000ff;">&lt;http://cloud.ticbeat.com/2016/07/sony-bater&#237;a.jpg&gt;</span> 

  <span style="color: #0000ff;">&lt;http://cloud.ticbeat.com/2016/07/sony-bater&#237;as-explosi&#243;n.mp4&gt;</span> 
    <span style="color: #a020f0;">a</span> <span style="color: #228b22;">dctype:</span><span style="color: #008b8b;">MovingImage</span>;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">format</span> <span style="color: #8b2252;">"video/mp4"</span>.

  <span style="color: #0000ff;">&lt;http://cloud.ticbeat.com/2016/07/sony-bater&#237;a.jpg&gt;</span> 
    <span style="color: #a020f0;">a</span> <span style="color: #228b22;">dctype:</span><span style="color: #008b8b;">StillImage</span>;
    <span style="color: #228b22;">dc:</span><span style="color: #008b8b;">format</span> <span style="color: #8b2252;">"image/jpeg"</span>.
}
</pre>
</div>

<p>
Files:
</p>
<ul class="org-ul">
<li>old: <a href="http://grinder1.multisensorproject.eu/cepfiles/multiTest/validated/">http://grinder1.multisensorproject.eu/cepfiles/multiTest/validated/</a>
</li>
<li>new: <a href="http://grinder1.multisensorproject.eu/cepfiles/multiTest/41d28d-GERMAN_SIMMMO-5-9-2016.ttl">http://grinder1.multisensorproject.eu/cepfiles/multiTest/41d28d-GERMAN_SIMMMO-5-9-2016.ttl</a> and <a href="http://grinder1.multisensorproject.eu/cepfiles/multiTest/41d28d-CONTEXT_EXTRACTION-5-9-2016.ttl">http://grinder1.multisensorproject.eu/cepfiles/multiTest/41d28d-CONTEXT_EXTRACTION-5-9-2016.ttl</a>
</li>
</ul>

<p>
Checking:
</p>
<ul class="org-ul">
<li>added prefixes <code>bibo: upf-pos-spa: upf-dep-deu: upf-pos-deu:</code>
  (before we only had <code>upf-dep-spa:</code>). Please update.
</li>
<li>Would also be nice to translate <code>schema:keywords</code>
  (currently is "preisportal, vergleich, check24, verivox, billiger, idealo, geizhals, tricks, betrug, geld" in both DE original and EN translation)
</li>
<li>All the rest is ok
</li>
</ul>
</div>
