validation.org
*** TODO BabelNet Multilingual Labels
The Entity Linking Service can find BN concepts in any language, because BN concepts have multilingual labels.
This is unrelated to whether the SIMMO is translated to another language or not.
It's up to the UI to filter BN labels and show only labels in the selected language.

However, not all BN concepts have labels in all MS languages.
Therefore the UI should implement some *language fall-back* logic:
- if no label in the selected language is available, show the EN label
- TODO Boyan: check whether all BN concepts have EN labels.

*** CANCEL Add Spanish BabelNet Labels
Gerard, as we saw above, Babelfy recognizes "batería de iones de litio" 
but bn:s01289274n does not have ES label (has EN, FR, DE, BG).
This concept has [[http://babelnet.org/synset?word%3DBater%C3%ADa%2Bde%2Bion%2Bde%2Blitio&lang%3DES&details%3D1&orig%3DBater%C3%ADa%2Bde%2Bion%2Bde%2Blitio][ES representation on the BN site]]. 
Do you need to add Spanish labels?
- Gerard <2016-09-01>: The EL service is using the 2.5.1 release of BabelNet to fetch the translations, as these cannot be retrieved using Babelfy's API, so it is possible that some synset senses have translations in the latest version online (suppose it matches 3.7) which aren't found in 2.5.1.
- Vladimir: When we got complete BN data (for the concepts found by you plus their ancestors), we used BN online, which includes all needed labels.
  Eg http://babelnet.org/rdf/s01289274n refers to 38 ES labels, which you can see on http://babelnet.org/rdf/values/-lemon:reference/s01289274n
  - (Note: BN was down on <2016-09-02 Fri>: "Error parsing configuration file <file:/home/debian/storage/apache-tomcat-7.0.65/webapps/rdf/WEB-INF/config.ttl>: Error making the query, see cause for details")

*** Translated-content Queries
**** Find Entities
All queries for a single language (eg find concepts) won't change. 
Eg here is how to find entities in the original and translated SIMMOs (hopefully the same entities will be recognized).
We just change the graph:
#+BEGIN_SRC SPARQL
# ES Original
select distinct ?concept ?label {
  graph ms-content:156e0d {[] itsrdf:taIdentRef ?entity}.
  ?entity skos:prefLabel ?label
}

# EN Translation
select distinct ?concept ?label {
  graph ms-content:156e0d-en {[] itsrdf:taIdentRef ?entity}.
  ?entity skos:prefLabel ?label
}
#+END_SRC

**** Select Single Label
We can filter to entity labels in the selected language, implementing "language fall-back".
~coalesce()~ picks the first bound variable.
We don't need it for EN since we assume all BN concepts have EN.
#+BEGIN_SRC SPARQL
# ES Original
select distinct ?concept (coalesce(?labelEs,?labelEn) as ?label) {
  graph ms-content:156e0d {[] itsrdf:taIdentRef ?entity}.
  ?entity skos:prefLabel ?labelEn filter(lang(?labelEn)="en")
  optional {?entity skos:prefLabel ?labelEs filter(lang(?labelEn)="es")}
}

# EN Translation
select distinct * {
  graph ms-content:156e0d-en {[] itsrdf:taIdentRef ?entity}.
  ?entity skos:prefLabel ?label filter(lang(?labelEn)="en")
}
#+END_SRC

**** Find Translations 
To find all translations of a SIMMO we make a query across graphs (i.e. in the default graph, which is a union of all graphs).
Remember that ~$~ indicates a query paramter (while ~?~ indicates a free variable):
#+BEGIN_SRC sparql
select * {
  ?translatedSIMMO bibo:translationOf $SIMMO; dc:language ?translatedLang}
#+END_SRC

To find all translations in a given language:
#+BEGIN_SRC sparql
select * {
  ?translatedSIMMO bibo:translationOf ?SIMMO; dc:language $lang}
#+END_SRC

To find all original SIMMOs (not translations):
#+BEGIN_SRC sparql
select * {?simmo filter not exists {?simmo bibo:translationOf []}}
#+END_SRC

To check whether a given SIMMO is a translation:
#+BEGIN_SRC sparql
ask {$simmo bibo:translationOf []}
#+END_SRC

* TODO nif: instead of nif-ann:
The current draft of NIF2.1 uses [[https://github.com/NLP2RDF/ontologies/blob/nif2.1/nif-core/nif-core.ttl#L895-L910][namespace nif: instead of nif-ann:]].
About 4-5m ago I wrote about the instability of NIF2.1 namespaces;
and I posted some issues to github that they should preserve the namespaces of all existing properties.
It seems they took this advice to the extreme, and changed the namespace of new props back to nif: as well.

Is there time to fix our data and software to use nif: instead of nif-ann: ?
