validation.html

<div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="todo TODO">TODO</span> BabelNet Multilingual Labels</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
The Entity Linking Service can find BN concepts in any language, because BN concepts have multilingual labels.
This is unrelated to whether the SIMMO is translated to another language or not.
It's up to the UI to filter BN labels and show only labels in the selected language.
</p>

<p>
However, not all BN concepts have labels in all MS languages.
Therefore the UI should implement some <b>language fall-back</b> logic:
</p>
<ul class="org-ul">
<li>if no label in the selected language is available, show the EN label
</li>
<li>TODO Boyan: check whether all BN concepts have EN labels.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="done CANCEL">CANCEL</span> Add Spanish BabelNet Labels</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
Gerard, as we saw above, Babelfy recognizes "batería de iones de litio" 
but bn:s01289274n does not have ES label (has EN, FR, DE, BG).
This concept has <a href="http://babelnet.org/synset?word=Batería+de+ion+de+litio&lang=ES&details=1&orig=Batería+de+ion+de+litio">ES representation on the BN site</a>. 
Do you need to add Spanish labels?
</p>
<ul class="org-ul">
<li>Gerard <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-09-01&gt;</span></span>: The EL service is using the 2.5.1 release of BabelNet to fetch the translations, as these cannot be retrieved using Babelfy's API, so it is possible that some synset senses have translations in the latest version online (suppose it matches 3.7) which aren't found in 2.5.1.
</li>
<li>Vladimir: When we got complete BN data (for the concepts found by you plus their ancestors), we used BN online.
</li>
</ul>
<p>
So <a href="http://babelnet.org/rdf/s01157392n">http://babelnet.org/rdf/s01157392n</a> should include all needed labels.
(But right now it is down: "Error parsing configuration file <a href="file://c:/home/debian/storage/apache-tomcat-7.0.65/webapps/rdf/WEB-INF/config.ttl">file://c:/home/debian/storage/apache-tomcat-7.0.65/webapps/rdf/WEB-INF/config.ttl</a>: Error making the query, see cause for details")
</p>
</div>
</div>

<div id="outline-container-sec-2-6-3" class="outline-4">
<h4 id="sec-2-6-3">Translated-content Queries</h4>
<div class="outline-text-4" id="text-2-6-3">
</div><div id="outline-container-sec-2-6-3-1" class="outline-5">
<h5 id="sec-2-6-3-1">Find Entities</h5>
<div class="outline-text-5" id="text-2-6-3-1">
<p>
All queries for a single language (eg find concepts) won't change. 
Eg here is how to find entities in the original and translated SIMMOs (hopefully the same entities will be recognized).
We just change the graph:
</p>
<div class="org-src-container">

<pre class="src src-SPARQL"><span style="color: #b22222;"># ES Original</span>
<span style="color: #a020f0;">select</span> <span style="color: #a020f0;">distinct</span> <span style="color: #a0522d;">?concept</span> <span style="color: #a0522d;">?label</span> {
  <span style="color: #a020f0;">graph</span> ms-content:156e0d {[] itsrdf:taIdentRef <span style="color: #a0522d;">?entity</span>}.
  <span style="color: #a0522d;">?entity</span> skos:prefLabel <span style="color: #a0522d;">?label</span>
}

<span style="color: #b22222;"># EN Translation</span>
<span style="color: #a020f0;">select</span> <span style="color: #a020f0;">distinct</span> <span style="color: #a0522d;">?concept</span> <span style="color: #a0522d;">?label</span> {
  <span style="color: #a020f0;">graph</span> ms-content:156e0d-en {[] itsrdf:taIdentRef <span style="color: #a0522d;">?entity</span>}.
  <span style="color: #a0522d;">?entity</span> skos:prefLabel <span style="color: #a0522d;">?label</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6-3-2" class="outline-5">
<h5 id="sec-2-6-3-2">Select Single Label</h5>
<div class="outline-text-5" id="text-2-6-3-2">
<p>
We can filter to entity labels in the selected language, implementing "language fall-back".
<code>coalesce()</code> picks the first bound variable.
We don't need it for EN since we assume all BN concepts have EN.
</p>
<div class="org-src-container">

<pre class="src src-SPARQL"><span style="color: #b22222;"># ES Original</span>
<span style="color: #a020f0;">select</span> <span style="color: #a020f0;">distinct</span> <span style="color: #a0522d;">?concept</span> (coalesce(<span style="color: #a0522d;">?labelEs</span>,<span style="color: #a0522d;">?labelEn</span>) <span style="color: #a020f0;">as</span> <span style="color: #a0522d;">?label</span>) {
  <span style="color: #a020f0;">graph</span> ms-content:156e0d {[] itsrdf:taIdentRef <span style="color: #a0522d;">?entity</span>}.
  <span style="color: #a0522d;">?entity</span> skos:prefLabel <span style="color: #a0522d;">?labelEn</span> <span style="color: #a020f0;">filter</span>(lang(<span style="color: #a0522d;">?labelEn</span>)=<span style="color: #8b2252;">"en"</span>)
  <span style="color: #a020f0;">optional</span> {<span style="color: #a0522d;">?entity</span> skos:prefLabel <span style="color: #a0522d;">?labelEs</span> <span style="color: #a020f0;">filter</span>(lang(<span style="color: #a0522d;">?labelEn</span>)=<span style="color: #8b2252;">"es"</span>)}
}

<span style="color: #b22222;"># EN Translation</span>
<span style="color: #a020f0;">select</span> <span style="color: #a020f0;">distinct</span> * {
  <span style="color: #a020f0;">graph</span> ms-content:156e0d-en {[] itsrdf:taIdentRef <span style="color: #a0522d;">?entity</span>}.
  <span style="color: #a0522d;">?entity</span> skos:prefLabel <span style="color: #a0522d;">?label</span> <span style="color: #a020f0;">filter</span>(lang(<span style="color: #a0522d;">?labelEn</span>)=<span style="color: #8b2252;">"en"</span>)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6-3-3" class="outline-5">
<h5 id="sec-2-6-3-3">Find Translations</h5>
<div class="outline-text-5" id="text-2-6-3-3">
<p>
To find all translations of a SIMMO we make a query across graphs (i.e. in the default graph, which is a union of all graphs).
Remember that <code>$</code> indicates a query paramter (while <code>?</code> indicates a free variable):
</p>
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">select</span> * {
  <span style="color: #a0522d;">?translatedSIMMO</span> bibo:translationOf <span style="color: #a0522d;">$SIMMO</span>; dc:language <span style="color: #a0522d;">?translatedLang</span>}
</pre>
</div>

<p>
To find all translations in a given language:
</p>
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">select</span> * {
  <span style="color: #a0522d;">?translatedSIMMO</span> bibo:translationOf <span style="color: #a0522d;">?SIMMO</span>; dc:language <span style="color: #a0522d;">$lang</span>}
</pre>
</div>

<p>
To find all original SIMMOs (not translations):
</p>
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">select</span> * {<span style="color: #a0522d;">?simmo</span> <span style="color: #a020f0;">filter</span> <span style="color: #a020f0;">not</span> <span style="color: #a020f0;">exists</span> {<span style="color: #a0522d;">?simmo</span> bibo:translationOf []}}
</pre>
</div>

<p>
To check whether a given SIMMO is a translation:
</p>
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">ask</span> {<span style="color: #a0522d;">$simmo</span> bibo:translationOf []}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-09-05&gt;</span></span></p>
<p class="author">Author: Vladimir Alexiev</p>
<p class="creator">Emacs 25.0.50.1 (Org mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
